[
  {
    "paper_id": "1",
    "day": "10",
    "year": "2023",
    "paper_title": "From Pixels to Pathology: A Novel Dual-Pathway Multi-Scale Hierarchical Upsampling Network for MRI-based Prostate Zonal Segmentation",
    "journal_name": "Expert Systems With Applications",
    "short_description": "Prostate cancer is a prevalent and life-threatening disease characterized by abnormal cell growth within the prostate gland. Early\r\nand accurate diagnosis of prostate cancer is crucial for effective treatment planning. MRI is valuable for diagnosing and assessing\r\nprostate cancer. Medical professionals use MRI to create segmentation for detecting prostate cancer.",
    "long_description": "Prostate cancer is a prevalent and life-threatening disease characterized by abnormal cell growth within the prostate gland. Early\r\nand accurate diagnosis of prostate cancer is crucial for effective treatment planning. MRI is valuable for diagnosing and assessing\r\nprostate cancer. Medical professionals use MRI to create segmentation for detecting prostate cancer. However, existing segmen-\r\ntation methods are limited in accurately delineating anatomical structures and tumor regions within the prostate. This research\r\nproposes an innovative methodology for advancing MRI-based prostate segmentation. The objective is to encompass anatomical\r\nand tumor zones within the prostate, facilitating precise diagnosis and treatment planning. The proposed dual-pathway multi-scale\r\nhierarchical upsampling network introduces significant modifications compared to the traditional UNet-based architecture. It out-\r\nperforms previous studies, demonstrating superior performance in anatomical segmentation on both the ProstateX and Prostate158\r\ndatasets. It achieves an intersection over union of 0.8449 and a dice similarity coefficient of 0.9872 on ProstateX, as well as an\r\nintersection over union of 0.8065 and a dice similarity coefficient of 0.9831 on Prostate158, suppressing previous research by a\r\nsignificant margin. These results highlight the potential of this approach to advance the utility of MRI in diagnosing and planning\r\nthe treatment of prostate-related pathologies, benefiting both patients and healthcare practitioners.",
    "author_name": "Kazi Shahriar Sanjid, Md. Shakib Shahariar Junayed, Md. Tanzim Hossain, Yu-Long Wang, M. Monir Uddin, Sheikh Anisul Haque",
    "link": null,
    "month": "NOV",
    "paper_type": "Submitted",
    "project_id": null
  },
  {
    "paper_id": "2",
    "day": "11",
    "year": "2017",
    "paper_title": "A computationally effective time-restricted stability preserving H2-optimal model order reduction approach",
    "journal_name": "Results in Control and Optimization",
    "short_description": "Several approaches for reducing model order on the definite time segments have become the topic of investigation in a series of papers that bring challenges during application in a large-scale setting.",
    "long_description": "Several approaches for reducing model order on the definite time segments have become the topic of investigation in a series of papers that bring challenges during application in a large-scale setting. The subject of discussion of this paper is the computationally efficient time-restricted \r\nH2-optimal model order reduction method of higher dimensional sparse systems that requires the solutions of time-restricted Lyapunov and Sylvester equations. Our discussion is on developing the algorithms to solve these matrix equations that face difficulty when calculating the matrix exponential of the large-scale matrices. As a result, an efficient remedy is also proposed to compute the matrix exponential. Our ideas are also evaluated for index-1 descriptor systems apart from the generalized structure. Numerical analyses are conducted on several benchmark examples to illustrate how accurate and efficient our suggested approaches are by comparing them with the existing methods.",
    "author_name": "Xin Du, Kife I. Bin Iqbal, M. Monir Uddin, Md. Tanzim Hossain, Md. Nazmul Islam Shuzan",
    "link": "https://www.sciencedirect.com/science/article/pii/S266672072300019X",
    "month": "JUN",
    "paper_type": "Journal",
    "project_id": "3"
  },
  {
    "paper_id": "3",
    "day": "15",
    "year": "2019",
    "paper_title": "Computational Methods for Approximation of Large-Scale Dynamical Systems",
    "journal_name": "Chapman and Hall/CRC, New York",
    "short_description": "These days, computer-based simulation is considered the quintessential approach to exploring new ideas in the different disciplines of  science, engineering and technology (SET). To perform simulations, a physical system needs to be modeled using mathematics; these models are often represented by linear time-invariant (LTI) continuous-time (CT) systems. Oftentimes these systems are subject to additional algebraic constraints, leading to first- or second-order differential-algebraic equations (DAEs), otherwise known as descriptor systems. Such large-scale systems generally lead to massive memory requirements and enormous computational complexity, thus restricting frequent simulations, which are required by many applications.",
    "long_description": "These days, computer-based simulation is considered the quintessential approach to exploring new ideas in the different disciplines of  science, engineering and technology (SET). To perform simulations, a physical system needs to be modeled using mathematics; these models are often represented by linear time-invariant (LTI) continuous-time (CT) systems. Oftentimes these systems are subject to additional algebraic constraints, leading to first- or second-order differential-algebraic equations (DAEs), otherwise known as descriptor systems. Such large-scale systems generally lead to massive memory requirements and enormous computational complexity, thus restricting frequent simulations, which are required by many applications. To resolve these complexities, the higher-dimensional system may be approximated by a substantially lower-dimensional one through model order reduction (MOR) techniques. Computational Methods for Approximation of Large-Scale Dynamical Systems discusses computational techniques for the MOR of large-scale sparse LTI CT systems. Although the book puts emphasis on the MOR of  descriptor systems, it begins by showing and comparing the various MOR techniques for standard systems.\r\n\r\nThe book also discusses the low-rank alternating direction implicit (LR-ADI) iteration and the issues related to solving the Lyapunov equation of large-scale sparse LTI systems to compute the low-rank Gramian factors, which are important components for implementing the Gramian-based MOR.\r\n\r\nAlthough this book is primarly aimed at post-graduate students and researchers of the various SET disciplines, the basic contents of this book can be supplemental to the advanced bachelor's-level students as well. It can also serve as an invaluable reference to researchers working in academics and industries alike.",
    "author_name": "M. M. Uddin",
    "link": "https://www.taylorfrancis.com/books/mono/10.1201/9781351028622/computational-methods-approximation-large-scale-dynamical-systems-mohammad-monir-uddin",
    "month": "MAY",
    "paper_type": "Book",
    "project_id": null
  },
  {
    "paper_id": "4",
    "day": "28",
    "year": "2020",
    "paper_title": "IoT and Computer Vision-Based Electronic Voting System",
    "journal_name": "Advances in Computer, Communication and Computational Sciences",
    "short_description": "Focusing on complete transparency with maximum security, a novel type of advanced electronic voting system is introduced in this paper. Identification and verification of voters are assured by microchip embedded national identity (NID) card and biometric fingerprint technology, which is unique for every single voter.",
    "long_description": "Focusing on complete transparency with maximum security, a novel type of advanced electronic voting system is introduced in this paper. Identification and verification of voters are assured by microchip embedded national identity (NID) card and biometric fingerprint technology, which is unique for every single voter. Also, with the help of live image processing technology, this system becomes more secure and effective. As voting is an individual opinion among multiple, so the second influence is unacceptable. So while voting if multiple faces detected by the camera module of the voting machine, automatically the vote will not be counted. Viola–Jones algorithm for face detection and local binary pattern histogram (LBPH) algorithm for face recognition has begun the image preparing innovation increasingly exact and faster. Four connected machines work together to accumulate each successful vote in this system. To reduce corrupted situation and to recapture the faith of mass people on the election, this inexpensive and effective system can play a vital role.",
    "author_name": "Md. Nazmul Islam Shuzan, Mahmudur Rashid, Md. Aowrongajab Uaday and M. M. Uddin",
    "link": "https://link.springer.com/chapter/10.1007/978-981-15-4409-5_56",
    "month": "OCT",
    "paper_type": "Book Chapters",
    "project_id": null
  },
  {
    "paper_id": "5",
    "day": "18",
    "year": "2021",
    "paper_title": "Towards an Improved Eigensystem Realization Algorithm for Low-Error Guarantees",
    "journal_name": "Proceedings of International Joint Conference on Advances in Computational Intelligence",
    "short_description": "Eigensystem realization algorithm (ERA) is a tool that can produce a reduced order model (ROM) from just input–output data of a given system. ERA creates the ROM while keeping the number of internal states to a minimum level.",
    "long_description": "Eigensystem realization algorithm (ERA) is a tool that can produce a reduced order model (ROM) from just input–output data of a given system. ERA creates the ROM while keeping the number of internal states to a minimum level. This was first implemented by Juang and Pappa (1984) to analyze the vibration of aerospace structures from impulse response. We reviewed ERA and tested it on single input single output (SISO) system as well as on multiple inputs single output (MISO) system. ERA prediction agreed with the actual data. Unlike other model reduction techniques (balanced truncation, balanced proper orthogonal decomposition), ERA works just as fine without the need of the adjoint system, that makes ERA a promising, completely data-driven, thrifty model reduction method. In this work, we propose a modified eigensystem realization algorithm that relies upon an optimally chosen time resolution for the output used and also checks for good performance through frequency analysis. Four examples are discussed: the first two confirm the model generating ability and the last two illustrate its capability to produce a low-dimensional model (for a large-scale system) that is much more accurate than the one produced by the traditional ERA.",
    "author_name": "Mohammad N. Murshed, Moajjem Hossain Chowdhury, Md. Nazmul Islam Shuzan and M. M. Uddin and M. Forhad Uddi",
    "link": "https://link.springer.com/chapter/10.1007/978-981-16-0586-4_4",
    "month": "MAY",
    "paper_type": "Book Chapters",
    "project_id": null
  },
  {
    "paper_id": "6",
    "day": "18",
    "year": "2021",
    "paper_title": "Time Restricted Balanced Truncation for Index-I Descriptor Systems with Non-homogeneous Initial Condition",
    "journal_name": "Proceedings of International Joint Conference on Advances in Computational Intelligence",
    "short_description": "In this paper, we discuss on the time restricted balanced truncation of index-I descriptor system with non-homogeneous initial condition in order to find better low-rank approximation of large-scale systems on nominated time interval.",
    "long_description": "In this paper, we discuss on the time restricted balanced truncation of index-I descriptor system with non-homogeneous initial condition in order to find better low-rank approximation of large-scale systems on nominated time interval. At first, we create a basis matrix spanning the null space with a view to extend the input matrix what makes the whole procedure working efficiently with non-homogeneous initial condition. Next, the low-rank Gramian factors are computed by solving the time restricted Lyapunov equations of index-I system using rational Krylov subspace method (RKSM) what is followed by reducing the time restricted large sparse system through balanced truncation (BT) technique. We select various data models of index-I system for numerical experiments to demonstrate the efficiency of the proposed techniques on restricted time interval.",
    "author_name": "Kife I. Bin Iqbal1, Xin Du, M. M. Uddin and M. Forhad Uddin",
    "link": "https://link.springer.com/chapter/10.1007/978-981-16-0586-4_15",
    "month": "MAY",
    "paper_type": "Book Chapters",
    "project_id": "2"
  },
  {
    "paper_id": "7",
    "day": "30",
    "year": "2020",
    "paper_title": "Conic Programming Approach to Reduce Congestion Ratio in Communications Network",
    "journal_name": "International Conference on Cyber Security and Computer Science",
    "short_description": "This research introduce a robust optimization model to reduce the congestion ratio in communications network considering uncertainty in the traffic demands. The propose formulation is depended on a model called the pipe model.",
    "long_description": "This research introduce a robust optimization model to reduce the congestion ratio in communications network considering uncertainty in the traffic demands. The propose formulation is depended on a model called the pipe model. Network traffic demand is fixed in the pipe model and most of the previous researches consider traffic fluctuation locally. Our proposed model can deal with fluctuation in the traffic demands and considers this fluctuation all over the network. We formulate the robust optimization model in the form of second-order cone programming (SOCP) problem which is tractable by optimization software. The numerical experiments determine the efficiency of our model in terms of reducing the congestion ratio compared to the Others model.",
    "author_name": "B. C. Das, M. Begum, M. M. Uddin and M. M. Rahman",
    "link": "https://link.springer.com/chapter/10.1007/978-3-030-52856-0_45",
    "month": "JUL",
    "paper_type": "Book Chapters",
    "project_id": null
  },
  {
    "paper_id": "8",
    "day": "4",
    "year": "2020",
    "paper_title": "Interpolatory projection technique for Riccati-based feedback stabilization of index-1 descriptor systems",
    "journal_name": "IOP Conference Series: Materials Science and Engineering",
    "short_description": "The work aims to stabilize the unstable index-1 descriptor systems by Riccati-based feedback stabilization via a modified form of Iterative Rational Krylov Algorithm (IRKA), which is a bi-tangential interpolation-based technique.",
    "long_description": "The work aims to stabilize the unstable index-1 descriptor systems by Riccati-based feedback stabilization via a modified form of Iterative Rational Krylov Algorithm (IRKA), which is a bi-tangential interpolation-based technique. In the basic IRKA, for the stable systems the Reduced Order Models (ROMs) can be found conveniently, but it is unsuitable for the unstable ones. In the proposed technique, the initial feedback is implemented within the construction of the projectors of the IRKA approach. The solution of the Riccati equation is estimated from the ROM achieved by IRKA and hence the low-rank feedback matrix is attained. Using the reverse projecting process, for the full model the optimal feedback matrix is retrieved from the low-rank feedback matrix. Finally, to validate the aptness and competency of the proposed technique it is applied to unstable index-1 descriptor systems. The comparison of the present work with two previous works is narrated. The simulation is done by numerical computation using MATLAB, and both the tabular method and graphical method are used as the supporting tools of comparative analysis.",
    "author_name": "Mahtab Uddin, M. M. Uddin, M. A. Hakim Khan and Md. Motlubar Rahman",
    "link": "https://iopscience.iop.org/article/10.1088/1757-899X/1070/1/012022/meta",
    "month": "DEC",
    "paper_type": "Book Chapters",
    "project_id": null
  },
  {
    "paper_id": "9",
    "day": "23",
    "year": "2020",
    "paper_title": "Computational Techniques for Structure Preserving Model Reduction of Constrain Dynamica",
    "journal_name": "Proceedings of International Joint Conference on Computational Intelligence",
    "short_description": "This paper discusses an efficient technique for the model order reduction (MOR) of second-order index 3 systems which are arising in different disciplines of science and technology.",
    "long_description": "This paper discusses an efficient technique for the model order reduction (MOR) of second-order index 3 systems which are arising in different disciplines of science and technology. The paper focuses on the second-order-to-second-order reduction techniques of the underlying systems using balanced truncation (BT). The index 3 second-order system can be converted into a standard second-order system; however, this causes the system to lose its sparsity. The main contribution of this paper is to apply the MOR method by exploiting the sparsity of the original model. This approach is efficient as it saves memory and reduces computational cost drastically. Numerical results are shown to prove the reflectivity and efficiency of the techniques.",
    "author_name": "M. M. Uddin",
    "link": "https://link.springer.com/chapter/10.1007/978-981-15-3607-6_39",
    "month": "MAY",
    "paper_type": "Book Chapters",
    "project_id": null
  },
  {
    "paper_id": "10",
    "day": "1",
    "year": "2023",
    "paper_title": "Machine learning-based classification of healthy and impaired gaits using 3D-GRF signals",
    "journal_name": "Biomedical Signal Processing and Control",
    "short_description": "Gait analysis is helpful for rehabilitation, clinical diagnoses, and sporting activities. Among the gathered signals, ground reaction forces (GRF) may be used for assisting doctors in recognizing and categorizing gait patterns using Machine-Learning methods.",
    "long_description": "Gait analysis is helpful for rehabilitation, clinical diagnoses, and sporting activities. Among the gathered signals, ground reaction forces (GRF) may be used for assisting doctors in recognizing and categorizing gait patterns using Machine-Learning methods. In this study, GaitRec and Gutenberg databases were used, where GaitRec contains 2645 gait disorder (GD) patients and 211 Healthy Controls (HCs), and the Gutenberg database has 350 HCs. The combined database has HCs and four GD classes: hip, knee, ankle, and calcaneus. GD is an abnormality in the hip, knee, or ankle joints, whereas Calcaneus gait is calcaneus fractures or ankle fusions. We pre-processed the GRF signals, applied different feature extraction techniques, removed the highly correlated features, and ranked the features using three feature selection algorithms. K-nearest neighbour model (KNN) showed the top performance in terms of accuracy in all experiments. Four different experimental schemes were pursued: (i) 6 binary classifications; (ii) 1 three-class classification; (iii) 2 four-class classifications; (iv) one five-class classification. We also compared the performance of vertical GRF with three-dimensional GRF. We found that using three-dimensional GRF increased the overall performance. Furthermore, it is found that time-domain and Wavelet features are among the most useful in identifying gait patterns. The findings show promising performance in automated gait disorder classification.",
    "author_name": "Md Nazmul Islam Shuzan, Muhammad E.H. Chowdhury, Mamun Bin Ibne Reaz, Amith Khandakar, Farhan Fuad Abir, Md. Ahasan Atick Faisal, Sawal Hamid Md Ali, Ahmad Ashrif A. Bakar, Moajjem Hossain Chowdhury, Zaid B. Mahbub, M. M. Uddin, Mohammed Alhatou",
    "link": "https://www.sciencedirect.com/science/article/abs/pii/S1746809422009028",
    "month": "MAR",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "11",
    "day": "8",
    "year": "2022",
    "paper_title": "Comparative study on techniques of model order reduction using rational Krylov subspace method",
    "journal_name": "Journal of Interdisciplinary Mathematics",
    "short_description": "We present Model Reduction (MR) techniques of the 1st order system and 2nd order dynamical systems using the Balanced Truncation (BT) method [1, 2] and Projection onto the dominant Eigenspace of the Gramian (PDEG) method [3].",
    "long_description": "We present Model Reduction (MR) techniques of the 1st order system and 2nd order dynamical systems using the Balanced Truncation (BT) method [1, 2] and Projection onto the dominant Eigenspace of the Gramian (PDEG) method [3]. We get help from the well-known Rational Krylov Subspace Method (RKSM) [4] for BT and PDEG. We also mention the Lyapunov equations [1] with their solutions known as the system gramians. Finally, a comparison is shown between BT and PDEG methods using numerical experiments.",
    "author_name": "Md Saiduzzaman, Md Shafiqul Islam, M. M. Uddin, Mohammad Osman Gani",
    "link": "https://www.tandfonline.com/doi/abs/10.1080/09720502.2022.2133224",
    "month": "DEC",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "12",
    "day": "8",
    "year": "2022",
    "paper_title": "Generation of the mathematical model to analyze the dynamical behaviour of the blood flow",
    "journal_name": "Journal of Interdisciplinary Mathematics",
    "short_description": "This paper focuses on the mathematical model based on the input output realization with a view to analyzing the time-invariant dynamical behaviour of the blood flow through carotid artery. The entire system’s characteristic is governed by the Navier-Stokes equation which is represented in this paper as differential-algebraic matrix representation.",
    "long_description": "This paper focuses on the mathematical model based on the input output realization with a view to analyzing the time-invariant dynamical behaviour of the blood flow through carotid artery. The entire system’s characteristic is governed by the Navier-Stokes equation which is represented in this paper as differential-algebraic matrix representation. This mathematical representation is commonly known as state space model that is extracted from the Taylor-hood finite element discretization of the physical model. Later, for computational convenient, this model is divided into different sub-blocks studying the sparsity patterns of the matrices each of which contains the system’s parameters responsible for any dynamical changes. This form is well-known as index-II descriptor data model representing the relationship between the input external force applying to the artery’s boundary and the output measuring the changes in the blood velocity and the pressure. Based on the input-output realization, MATLAB interface is used to carry out numerical experiments and the results illustrate the numerical behaviour of the generated state space model for analyzing the blood flow nature through carotid artery.",
    "author_name": "Md Shafiqul Islam, Kife I Bin Iqbal, Md. Saiduzzaman, M. M. Uddin, Mohammad Osman Gani",
    "link": "https://www.tandfonline.com/doi/abs/10.1080/09720502.2022.2133229",
    "month": "DEC",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "13",
    "day": "14",
    "year": "2022",
    "paper_title": "Sparsity-Preserving Two-Sided Iterative Algorithm for Riccati-Based Boundary Feedback Stabilization of the Incompressible Navier–Stokes Flow",
    "journal_name": "Mathematical Problems in Engineering",
    "short_description": "In this paper, we explore the Riccati-based boundary feedback stabilization of the incompressible Navier–Stokes flow via the Krylov subspace techniques. Since the volume of data derived from the original models is gigantic, the feedback stabilization process through the Riccati equation is always infeasible.",
    "long_description": "In this paper, we explore the Riccati-based boundary feedback stabilization of the incompressible Navier–Stokes flow via the Krylov subspace techniques. Since the volume of data derived from the original models is gigantic, the feedback stabilization process through the Riccati equation is always infeasible. We apply a  optimal model-order reduction scheme for reduced-order modeling, preserving the sparsity of the system. An extended form of the Krylov subspace-based two-sided iterative algorithm (TSIA) is implemented, where the computation of an equivalent Sylvester equation is included for minimizing the computation time and enhancing the stability of the reduced-order models with satisfying the Wilson conditions. Inverse projection approaches are applied to get the optimal feedback matrix from the reduced-order models. To validate the efficiency of the proposed techniques, transient behaviors of the target systems are observed incorporating the tabular and figurative comparisons with MATLAB simulations. Finally, to reveal the advancement of the proposed techniques, we compare our work with some existing works.",
    "author_name": "Md. T. Islam, M. Uddin, M. M. Uddin, Md. A. H. Khan, Md. Tanzim Hossain",
    "link": "https://www.hindawi.com/journals/mpe/2022/4435167/",
    "month": "APR",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "14",
    "day": "14",
    "year": "2022",
    "paper_title": "Comparative Mathematical Study of Blood Flow Through Stenotic and Aneurysmatic Artery with the Presence and Absence of Blood clots",
    "journal_name": "Malaysian Journal for Mathematical Sciences",
    "short_description": "Numerical predictions of blood flow and hemodynamic properties through stenosis and aneurysm artery have been studied in the presence of blood clots at the constricted area. The finite element method has been used to solve the partial differential equations of continuity, momentum, Oldroyd-B, and bioheat transport in cartesian coordinates systems.",
    "long_description": "Numerical predictions of blood flow and hemodynamic properties through a stenotic and aneurysmal rigid artery are studied in the presence of blood clot at constricted area. Finite element method has been used to solve the steady partial differential equations of continuity, momentum, Oldroyd-B and bioheat transport in two dimensional cartesian coordinates system.The present investigation carries the potential to compute blood velocity, pressure and drag coefficient with major significance at the throat of stenosis and aneurysm. The models are also employed to study of simulation, influence of blood clot and hemodynamical characteristics for all modifications. The back flow and recirculation zones are found at stenotic and aneurysmal region for the model. The quantitative analysis is completed by numerical calculation having physiological significance of hemodynamical factors of blood flow depends on the dimensionless parameters which show the validity of present model.",
    "author_name": "M. N. Uddin, M. M. Uddin, M. M. Alam",
    "link": "https://mjms.upm.edu.my/lihatmakalah.php?kod=2022/September/16/3/599-623",
    "month": "JUL",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "15",
    "day": "2",
    "year": "2022",
    "paper_title": "Wavelet and Spectral Analysis of Normal and Abnormal Heart Sound for Diagnosing Cardiac Disorders",
    "journal_name": "BioMed Research International",
    "short_description": "Body auscultation is a frequent clinical diagnostic procedure used to diagnose heart problems. The key advantage of this clinical method is that it provides a cheap and effective solution that enables medical professionals to interpret heart sounds for the diagnosis of cardiac diseases.",
    "long_description": "Body auscultation is a frequent clinical diagnostic procedure used to diagnose heart problems. The key advantage of this clinical method is that it provides a cheap and effective solution that enables medical professionals to interpret heart sounds for the diagnosis of cardiac diseases. Signal processing can quantify the distribution of amplitude and frequency content for diagnostic purposes. In this experiment, the use of signal processing and wavelet analysis in screening cardiac disorders provided enough evidence to distinguish between the heart sounds of a healthy and unhealthy heart. Real-time data was collected using an IoT device, and the noise was reduced using the REES52 sensor. It was found that mean frequency is sufficiently discriminatory to distinguish between a healthy and unhealthy heart, according to features derived from signal amplitude distribution in the time and frequency domain analysis. The results of the present study indicate the adequate discrimination between the characteristics of heart sounds for automatic detection of cardiac problems by signal processing from normal and abnormal heart sounds.",
    "author_name": "Sharif Uddin, Parinda Rahman, Meratun Junnut Anee, Md Mehedi Hasan Rifat, M. M. Uddin",
    "link": "https://www.hindawi.com/journals/bmri/2022/9092346/",
    "month": "JUN",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "16",
    "day": "6",
    "year": "2022",
    "paper_title": "Towards an Adaptive Dynamic Mode Decomposition",
    "journal_name": "Results in Control and Optimization",
    "short_description": "Dynamic Mode Decomposition (DMD) is a tool that creates an approximate model from spatio-temporal data. We have developed an architecture of this tool that will adapt to the data from a given problem by leveraging time delay coordinates, projections, and robust principal component analysis.",
    "long_description": "Dynamic Mode Decomposition (DMD) is a tool that creates an approximate model from spatio-temporal data. We have developed an architecture of this tool that will adapt to the data from a given problem by leveraging time delay coordinates, projections, and robust principal component analysis. Our scheme which we call Adaptive Dynamic Mode Decomposition (ADMD) can be used in its exact form or the user may even utilize parts of the scheme for generating a DMD model that is more accurate and reliable compared to the one given by standard DMD. ADMD is demonstrated on several datasets of varying complexities and its performance appears to be promising.",
    "author_name": "Mohammad N.Murshed, M. M. Uddin",
    "link": "https://www.sciencedirect.com/science/article/pii/S2666720721000436?via%3Dihub",
    "month": "MAR",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "17",
    "day": "1",
    "year": "2021",
    "paper_title": "Computational techniques for  H2 optimal frequency-limited model order reduction of large-scale sparse linear systems",
    "journal_name": "Journal of Computational Science",
    "short_description": "We consider the problem of frequency limited H2 optimal model order reduction for large-scale sparse linear systems. A set of first-order H2 optimality conditions are derived for the frequency limited model order reduction problem.",
    "long_description": "We consider the problem of frequency limited H2 optimal model order reduction for large-scale sparse linear systems. A set of first-order H2 optimality conditions are derived for the frequency limited model order reduction problem. These conditions involve the solution of two frequency limited Sylvester equations that are known to be computationally complex. We discuss a framework for solving these matrix equations efficiently. The idea is also extended to the frequency limited H2 optimal model order reduction of index-1 descriptor systems. Numerical experiments are carried out using Python programming language and the results are presented to demonstrate the approximation accuracy and computational efficiency of the proposed technique.",
    "author_name": "Xin Du, Kife I. Bin Iqbal, M. M. Uddin, A. Mostakim Fony, Md. Tanzim Hossain, Mian Ilyas Ahmad, and Mohammaed Sahadat Hossain",
    "link": "https://www.sciencedirect.com/science/article/abs/pii/S1877750321001472?via%3Dihub",
    "month": "OCT",
    "paper_type": "Journal",
    "project_id": "1"
  },
  {
    "paper_id": "18",
    "day": "20",
    "year": "2021",
    "paper_title": "SVD-Krylov based Sparsity-preserving Techniques for Riccati-based Feedback Stabilization of Unstable Power System Models",
    "journal_name": "Journal of Engineering Advancements",
    "short_description": "We propose an efficient sparsity-preserving reduced-order modelling approach for index-1 descriptor systems extracted from large-scale power system models through two-sided projection techniques.",
    "long_description": "We propose an efficient sparsity-preserving reduced-order modelling approach for index-1 descriptor systems extracted from large-scale power system models through two-sided projection techniques. The projectors are configured by utilizing Gramian based singular value decomposition (SVD) and Krylov subspace-based reduced-order modelling. The left projector is attained from the observability Gramian of the system by the low-rank alternating direction implicit (LR-ADI) technique and the right projector is attained by the iterative rational Krylov algorithm (IRKA). The classical LR-ADI technique is not suitable for solving Riccati equations and it demands high computation time for convergence. Besides, in most of the cases, reduced-order models achieved by the basic IRKA are not stable and the Riccati equations connected to them have no finite solution. Moreover, the conventional LR-ADI and IRKA approaches do not preserve the sparse form of the index-1 descriptor systems, which is an essential requirement for feasible simulations. To overcome those drawbacks, the fitting of LR-ADI and IRKA based projectors from the left and right sides, respectively, desired reduced-order systems attained. So that, finite solution of low-rank Riccati equations, and corresponding feedback matrix can be executed. Using the mechanism of inverse projection, the Riccati-based optimal feedback matrix can be computed to stabilize the unstable power system models. The proposed approach will maintain minimized computation time and ?2 -norm of the error system for reduced-order models of the target models.",
    "author_name": "Mahtab Uddin, M. M. Uddin, M. A. Hakim Khan, M. Tanzim Hossain",
    "link": "https://scienpg.com/jea/index.php/jea/article/view/110",
    "month": "AUG",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "19",
    "day": "7",
    "year": "2021",
    "paper_title": "A Novel Non-Invasive Estimation of Respiration Rate From Motion Corrupted Photoplethysmograph Signal Using Machine Learning Model",
    "journal_name": "IEEE Access",
    "short_description": "Respiratory ailments such as asthma, chronic obstructive pulmonary disease (COPD), pneumonia, and lung cancer are life-threatening. Respiration rate (RR) is a vital indicator of the wellness of a patient. Continuous monitoring of RR can provide early indication and thereby save lives.",
    "long_description": "Respiratory ailments such as asthma, chronic obstructive pulmonary disease (COPD), pneumonia, and lung cancer are life-threatening. Respiration rate (RR) is a vital indicator of the wellness of a patient. Continuous monitoring of RR can provide early indication and thereby save lives. However, a real-time continuous RR monitoring facility is only available at the intensive care unit (ICU) due to the size and cost of the equipment. Recent researches have proposed Photoplethysmogram (PPG) and/ Electrocardiogram (ECG) signals for RR estimation however, the usage of ECG is limited due to the unavailability of it in wearable devices. Due to the advent of wearable smartwatches with built-in PPG sensors, it is now being considered for continuous monitoring of RR. This paper describes a novel approach for RR estimation using motion artifact correction and machine learning (ML) models with the PPG signal features. Feature selection algorithms were used to reduce computational complexity and the chance of overfitting. The best ML model and the best feature selection algorithm combination were fine-tuned to optimize its performance using hyperparameter optimization. Gaussian Process Regression (GPR) with Fit a Gaussian process regression model (Fitrgp) feature selection algorithm outperformed all other combinations and exhibits a root mean squared error (RMSE), mean absolute error (MAE), and two-standard deviation (2SD) of 2.63, 1.97, and 5.25 breaths per minute, respectively. Patients would be able to track RR at a lower cost and with less inconvenience if RR can be extracted efficiently and reliably from the PPG signal.",
    "author_name": "Md. Nazmul Islam Shuzan, Moajjem Hossain Chowdhury, Md. Shafayet Hossain, Muhammad E. H. Chowdhury, Mamun Ibne Reaz, M. M. Uddin, Amith Khandakar Zaid Bin Mahbub,Sawal Hamid Md. Ali",
    "link": "https://ieeexplore.ieee.org/abstract/document/9475991",
    "month": "JUL",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "20",
    "day": "22",
    "year": "2021",
    "paper_title": "SVD-Krylov based techniques for structure-preserving reduced order modelling of second-order systems",
    "journal_name": "Mathematical Modelling and Control",
    "short_description": "We introduce an efficient structure-preserving model-order reduction technique for the large-scale second-order linear dynamical systems by imposing two-sided projection matrices.",
    "long_description": "We introduce an efficient structure-preserving model-order reduction technique for the large-scale second-order linear dynamical systems by imposing two-sided projection matrices. The projectors are formed based on the features of the singular value decomposition (SVD) and Krylov-based model-order reduction methods. The left projector is constructed by utilizing the concept of the observability Gramian of the systems and the right one is made by following the notion of the interpolation-based technique iterative rational Krylov algorithm (IRKA). It is well-known that the proficient model-order reduction technique IRKA cannot ensure system stability, and the Gramian based methods are computationally expensive. Another issue is preserving the second-order structure in the reduced-order model. The structure-preserving model-order reduction provides a more exact approximation to the original model with maintaining some significant physical properties. In terms of these perspectives, the proposed method can perform better by preserving the second-order structure and stability of the system with minimized H2-norm. Several model examples are presented that illustrated the capability and accuracy of the introducing technique.",
    "author_name": "M. M. Rahman, M. Uddin, M. M. Uddin, LS Andallah",
    "link": "https://www.aimspress.com/article/doi/10.3934/mmc.2021006",
    "month": "JUN",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "21",
    "day": "1",
    "year": "2022",
    "paper_title": "Iterative Rational Krylov Algorithms for model reduction of a class of constrained structural dynamic system with Engineering applications",
    "journal_name": "Numerical Algebra, Control & Optimization",
    "short_description": "This paper discusses model order reduction of large sparse second-order index-3 differential algebraic equations (DAEs) by applying Iterative Rational Krylov Algorithm (IRKA).",
    "long_description": "This paper discusses model order reduction of large sparse second-order index-3 differential algebraic equations (DAEs) by applying Iterative Rational Krylov Algorithm (IRKA). In general, such DAEs arise in constraint mechanics, multibody dynamics, mechatronics and many other branches of sciences and technologies. By deflecting the algebraic equations the second-order index-3 system can be altered into an equivalent standard second-order system. This can be done by projecting the system onto the null space of the constraint matrix. However, creating the projector is computationally expensive and it yields huge bottleneck during the implementation. This paper shows how to find a reduce order model without projecting the system onto the null space of the constraint matrix explicitly. To show the efficiency of the theoretical works we apply them to several data of second-order index-3 models and experimental resultants are discussed in the paper.",
    "author_name": "Xin Du, M. M. Uddin, A. Mostakim Fony, Md. Tanzim Hossain and Md. Nazmul Islam Shuzan",
    "link": "https://www.aimsciences.org/article/doi/10.3934/naco.2021016",
    "month": "SEP",
    "paper_type": "Journal",
    "project_id": "2"
  },
  {
    "paper_id": "22",
    "day": "1",
    "year": "2020",
    "paper_title": "Structure preserving model order reduction of a class of second-order descriptor systems via balanced truncation",
    "journal_name": "Applied Numerical Mathematics",
    "short_description": "Large sparse second-order index-3 descriptor system arises in various disciplines of science and engineering including constraint mechanics, mechatronics (where mechanical and electrical elements are coupled) and circuit designs.",
    "long_description": "Large sparse second-order index-3 descriptor system arises in various disciplines of science and engineering including constraint mechanics, mechatronics (where mechanical and electrical elements are coupled) and circuit designs. Simulation, controller design and design optimization are some applications of such models. These tasks become challenging when the dimension of the system is high. This paper discusses a method to obtain a reduced second-order model from a large sparse second-order index-3 system using the Balanced Truncation. For this purpose, the low-rank alternating direction implicit iteration is modified to solve the Lyapunov equations of the index-3 structure system efficiently in an implicit way. Numerical resultants are discussed to show the reflectivity and efficiency of the techniques.",
    "author_name": "M. M. Uddin",
    "link": "https://www.sciencedirect.com/science/article/abs/pii/S0168927419303423",
    "month": "JUN",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "23",
    "day": "1",
    "year": "2020",
    "paper_title": "Estimating Blood Pressure from the Photoplethysmogram Signal and Demographic Features Using Machine Learning Techniques",
    "journal_name": "Sensors",
    "short_description": "Hypertension is a potentially unsafe health ailment, which can be indicated directly from the blood pressure (BP). Hypertension always leads to other health complications. Continuous monitoring of BP is very important;",
    "long_description": "Hypertension is a potentially unsafe health ailment, which can be indicated directly from the blood pressure (BP). Hypertension always leads to other health complications. Continuous monitoring of BP is very important; however, cuff-based BP measurements are discrete and uncomfortable to the user. To address this need, a cuff-less, continuous, and noninvasive BP measurement system is proposed using the photoplethysmograph (PPG) signal and demographic features using machine learning (ML) algorithms. PPG signals were acquired from 219 subjects, which undergo preprocessing and feature extraction steps. Time, frequency, and time-frequency domain features were extracted from the PPG and their derivative signals. Feature selection techniques were used to reduce the computational complexity and to decrease the chance of over-fitting the ML algorithms. The features were then used to train and evaluate ML algorithms. The best regression models were selected for systolic BP (SBP) and diastolic BP (DBP) estimation individually. Gaussian process regression (GPR) along with the ReliefF feature selection algorithm outperforms other algorithms in estimating SBP and DBP with a root mean square error (RMSE) of 6.74 and 3.59, respectively. This ML model can be implemented in hardware systems to continuously monitor BP and avoid any critical health conditions due to sudden changes.",
    "author_name": "M. H. Chowdhury, Md N. Islam Shuzan, M. E. H. Chowdhury, Z. B. Mahbub, M. M. Uddin, A. Khandakar, M. Bin Ibne Reaz",
    "link": "https://www.mdpi.com/1424-8220/20/11/3127",
    "month": "JUN",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "24",
    "day": "23",
    "year": "2020",
    "paper_title": "Tangential interpolatory projections for a class of second-order index-1 descriptor systems and application to Mechatronics",
    "journal_name": "Production Engineering",
    "short_description": "This paper studies the model order reduction of second-order index-1 descriptor systems using a tangential interpolation projection method based on the Iterative Rational Krylov Algorithm (IRKA).",
    "long_description": "This paper studies the model order reduction of second-order index-1 descriptor systems using a tangential interpolation projection method based on the Iterative Rational Krylov Algorithm (IRKA). Our primary focus is to reduce the system into a second-order form so that the structure of the original system can be preserved. For this purpose, the IRKA based tangential interpolatory method is modified to deal with the second-order structure of the underlying descriptor system efficiently in an implicit way. The paper also shows that by exploiting the symmetric properties of the system the implementing computational costs can be reduced significantly. Theoretical results are verified for the model reduction of the piezo actuator based adaptive spindle support which is second-order index-1 differential-algebraic form. The efficiency and accuracy of the method are demonstrated by analyzing the numerical results.",
    "author_name": "Md. Motlubar Rahman, M. M. Uddin, L. S. Andallah and Mahtab Uddin",
    "link": "https://link.springer.com/article/10.1007/s11740-020-00995-4",
    "month": "NOV",
    "paper_type": "Journal",
    "project_id": "1"
  },
  {
    "paper_id": "25",
    "day": "28",
    "year": "2020",
    "paper_title": "Interpolatory Projection Techniques For H2 Optimal Structure-Preserving Model Order Reduction Of Second-Order Systems",
    "journal_name": "Advances in Science, Technology and Engineering Systems Journal",
    "short_description": "This paper focuses on exploring efficient ways to find H2 optimal Structure-Preserving Model Order Reduction (SPMOR) of the second-order systems via interpolatory projection-based method Iterative Rational Krylov Algorithm (IRKA).",
    "long_description": "This paper focuses on exploring efficient ways to find H2 optimal Structure-Preserving Model Order Reduction (SPMOR) of the second-order systems via interpolatory projection-based method Iterative Rational Krylov Algorithm (IRKA). To get the reduced models of the second- order systems, the classical IRKA deals with the equivalent first-order converted forms and estimates the first-order reduced models. The drawbacks of that of the technique are failure of structure preservation and abolishing the properties of the original models, which are the key factors for some of the physical applications. To surpass those issues, we introduce IRKA based techniques that enable us to approximate the second-order systems through the reduced models implicitly without forming the first-order forms. On the other hand, there are very challenging tasks to the Model Order Reduction (MOR) of the large-scale second-order systems with the optimal H2 error norm and attain the rapid rate of convergence. For the convenient computations, we discuss competent techniques to determine the optimal H2 error norms efficiently for the second-order systems. The applicability and efficiency of the proposed techniques are validated by applying them to some large-scale systems extracted form engineering applications. The computations are done numerically using MATLAB simulation and the achieved results are discussed in both tabular and graphical approaches.",
    "author_name": "Md. Motlubar Rahman, M. M. Uddin, L. S. Andallah and Mahtab Uddin",
    "link": "https://www.astesj.com/v05/i04/p85/",
    "month": "AUG",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "26",
    "day": "1",
    "year": "2020",
    "paper_title": "Structure preserving model order reduction of a class of second-order descriptor systems via balanced truncation",
    "journal_name": "Applied Numerical Mathematics",
    "short_description": "Large sparse second-order index-3 descriptor system arises in various disciplines of science and engineering including constraint mechanics, mechatronics (where mechanical and electrical elements are coupled) and circuit designs.",
    "long_description": "Large sparse second-order index-3 descriptor system arises in various disciplines of science and engineering including constraint mechanics, mechatronics (where mechanical and electrical elements are coupled) and circuit designs. Simulation, controller design and design optimization are some applications of such models. These tasks become challenging when the dimension of the system is high. This paper discusses a method to obtain a reduced second-order model from a large sparse second-order index-3 system using the Balanced Truncation. For this purpose, the low-rank alternating direction implicit iteration is modified to solve the Lyapunov equations of the index-3 structure system efficiently in an implicit way. Numerical resultants are discussed to show the reflectivity and efficiency of the techniques.",
    "author_name": "M. M. Uddin",
    "link": "https://www.sciencedirect.com/science/article/abs/pii/S0168927419303423?via%3Dihub",
    "month": "JUN",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "27",
    "day": "31",
    "year": "2018",
    "paper_title": "Model Reduction of Structured Dynamical Systems by Projecting onto the Dominant Eigenspace of the Gramians",
    "journal_name": "Journal of Modeling and Optimization",
    "short_description": "This paper studies the structure preserving (second-order to second-order) model order reduction of second-order systems applying the projection onto the dominant eigenspace of the Gramians of the systems.",
    "long_description": "This paper studies the structure preserving (second-order to second-order) model order reduction of second-order systems applying the projection onto the dominant eigenspace of the Gramians of the systems. The projectors which create the reduced order model are generated cheaply from the low-rank Gramian factors. The low-rank Gramian factors are computed efficiently by solving the corresponding Lyapunov equations of the system using the rational Krylov subspace method. The efficiency of the theoretical results are then illustrated by numerical experiments.",
    "author_name": "S. Hasan and M. M. Uddin",
    "link": "https://www.xpublication.com/index.php/jmo/article/view/160",
    "month": "DEC",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "28",
    "day": "1",
    "year": "2019",
    "paper_title": "Iterative methods for solving large sparse Lyapunov equations and application to model reduction of index 1 differential-algebraic-equations",
    "journal_name": "Numerical Algebra, Control and Optimization (AIMS)",
    "short_description": "To implement the balancing based model reduction of large-scale dynamical systems we need to compute the low-rank (controllability and observability) Gramian factors by solving Lyapunov equations.",
    "long_description": "To implement the balancing based model reduction of large-scale dynamical systems we need to compute the low-rank (controllability and observability) Gramian factors by solving Lyapunov equations. In recent time, Rational Krylov Subspace Method (RKSM) is considered as one of the efficient methods for solving the Lyapunov equations of large-scale sparse dynamical systems. The method is well established for solving the Lyapunov equations of the standard or generalized state space systems. In this paper, we develop algorithms for solving the Lyapunov equations for large-sparse structured descriptor system of index-1. The resulting algorithm is applied for the balancing based model reduction of large sparse power system model. Numerical results are presented to show the efficiency and capability of the proposed algorithm.",
    "author_name": "M. Sumona Hossain and M. M. Uddin",
    "link": "https://www.aimsciences.org/article/doi/10.3934/naco.2019013",
    "month": "JAN",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "29",
    "day": "27",
    "year": "2018",
    "paper_title": "Gramian-based model-order reduction of constrained structural dynamic systems",
    "journal_name": "IET Control Theory & Applications",
    "short_description": "This study discusses model reduction techniques for second-order index 3 descriptor systems using the balanced truncation methods; in particular, linearised equations of motion with holonomic constraints are considered which arise in mechanics and multibody dynamics.",
    "long_description": "This study discusses model reduction techniques for second-order index 3 descriptor systems using the balanced truncation methods; in particular, linearised equations of motion with holonomic constraints are considered which arise in mechanics and multibody dynamics. It is shown that the index 3 system can be converted into an equivalent form of index 0 system by projecting it onto the hidden manifold. When model reduction is applied to the projected system, explicit formulation of the projected system is not required. The low-rank alternating direction implicit iteration is also discussed for solving the projected Lyapunov equations of the underlying descriptor system efficiently in an implicit way. The theoretical results are illustrated by numerical experiments.",
    "author_name": "M. M. Uddin",
    "link": "https://digital-library.theiet.org/content/journals/10.1049/iet-cta.2018.5580",
    "month": "NOV",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "30",
    "day": "14",
    "year": "2017",
    "paper_title": "Efficient Techniques for Solving the Periodic Projected Lyapunov Equations and Model Reduction of Periodic Systems",
    "journal_name": "Mathematical Problems in Engineering",
    "short_description": "We have presented the efficient techniques for the solutions of large-scale sparse projected periodic discrete-time Lyapunov equations in lifted form. These types of problems arise in model reduction and state feedback problems of periodic descriptor systems.",
    "long_description": "We have presented the efficient techniques for the solutions of large-scale sparse projected periodic discrete-time Lyapunov equations in lifted form. These types of problems arise in model reduction and state feedback problems of periodic descriptor systems. Two most popular techniques to solve such Lyapunov equations iteratively are the low-rank alternating direction implicit (LR-ADI) method and the low-rank Smith method. The main contribution of this paper is to update the LR-ADI method by exploiting the ideas of the adaptive shift parameters computation and the efficient handling of complex shift parameters. These approaches efficiently reduce the computational cost with respect to time and memory. We also apply these iterative Lyapunov solvers in balanced truncation model reduction of periodic discrete-time descriptor systems. We illustrate numerical results to show the performance and accuracy of the proposed methods.",
    "author_name": "M. Sahadat Hossain and M. M. Uddin",
    "link": "https://www.hindawi.com/journals/mpe/2017/4362641/",
    "month": "FEB",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "31",
    "day": "26",
    "year": "2016",
    "paper_title": "Structure preserving model order reduction of large sparse second-order index-1 systems and application to a mechatronics model",
    "journal_name": "Mathematical and Computer Modelling of Dynamical Systems",
    "short_description": "Nowadays, mechanical engineers heavily depend on mathematical models for simulation, optimization and controller design. In either of these tasks, reduced dimensional formulations are obligatory in order to achieve fast and accurate results.",
    "long_description": "Nowadays, mechanical engineers heavily depend on mathematical models for simulation, optimization and controller design. In either of these tasks, reduced dimensional formulations are obligatory in order to achieve fast and accurate results. Usually, the structural mechanical systems of machine tools are described by systems of second-order differential equations. However, they become descriptor systems when extra constraints are imposed on the systems. This article discusses efficient techniques of Gramian-based model-order reduction for second-order index-1 descriptor systems. Unlike, our previous work, here we mainly focus on a second-order to second-order reduction technique for such systems, where the stability of the system is guaranteed to be preserved in contrast to the previous approaches. We show that a special choice of the first-order reformulation of the system allows us to solve only one Lyapuov equation instead of two. We also discuss improvements of the technique to solve the Lyapunov equation using low-rank alternating direction implicit methods, which further reduces the computational cost as well as memory requirement. The proposed technique is applied to a structural finite element method model of a micro-mechanical piezo-actuators-based adaptive spindle support. Numerical results illustrate the increased efficiency of the adapted method.",
    "author_name": "P. Benner, J. Saak, and M. M. Uddin",
    "link": "https://www.tandfonline.com/doi/full/10.1080/13873954.2016.1218347",
    "month": "JUL",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "32",
    "day": "1",
    "year": "2015",
    "paper_title": "Balancing based model reduction for structured index-2 unstable descriptor systems with application to flow control",
    "journal_name": "Numerical Algebra, Control and Optimization (AIMS)",
    "short_description": "Stabilizing a flow around an unstable equilibrium is a typical problem in flow control. Model-based designed of modern controllers like LQR/LQG or H_inf compensators is often limited by the large-scale of the discretized flow models.",
    "long_description": "Stabilizing a flow around an unstable equilibrium is a typical problem in flow control. Model-based designed of modern controllers like LQR/LQG H_inf compensators is often limited by the large-scale of the discretized flow models. Therefore, model reduction is usually needed before designing such a controller. Here we suggest an approach based on applying balanced truncation for unstable systems to the linearized flow equations usually used for compensator design. For this purpose, we modify the ADI iteration for Lyapunov equations to deal with the index-2 structure of the underlying descriptor system efficiently in an implicit way. The resulting algorithm is tested for model reduction and control design of a linearized Navier-Stokes system describing von Kármán vortex shedding.",
    "author_name": "P. Benner, J. Saak, and M. M. Uddin",
    "link": "https://www.aimsciences.org/article/id/01f6d0e6-4c13-44fd-9471-8e3bf8978554",
    "month": "DEC",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "33",
    "day": "3",
    "year": "2015",
    "paper_title": "Reduce Order Modelling of Power System Models Using Interpolatory Projections Technique",
    "journal_name": "International Journal of Modeling and Optimization",
    "short_description": "Large, complex dynamical systems, such as, power systems, are very challenging task to model and analysis. Numerous techniques have been developed to handle the difficulties arising from the size and complexity of typical realistic power system models.",
    "long_description": "Large, complex dynamical systems, such as, power\r\nsystems, are very challenging task to model and analysis.\r\nNumerous techniques have been developed to handle the\r\ndifficulties arising from the size and complexity of typical\r\nrealistic power system models. These complexities demand to\r\nformulate reduced order dynamic equivalent models of power\r\nsystems in many applications and studies. Linearizing around\r\nthe equilibrium point, a stable time invariant power system\r\nmodel leads to index 1 differential-algebraic (DAE) system. A\r\nbalancing based model reduction technique for such a system is\r\ndiscussed in a paper of F. Freitas et al. in 2008. The main\r\ndrawback of this method is to compute two Gramian factors of\r\nthe system by solving two continuous-time algebraic Lyapunov\r\nequations. On the other hand interpolatory model reduction via\r\niterative rational Krylov algorithm (IRKA) is computationally\r\nefficient since it requires only matrix-vector products or linear\r\nsolvers. This paper contributes an interpolatory technique\r\nusing IRKA for a class of index 1 DAE systems to obtain\r\nreduced standard ordinary differential (ODE) systems. We also\r\nshow that a simple algebraic manipulation retrieve reduced\r\nindex-1 DAE systems. The proposed technique is applied to a\r\ndata of linearized power system models. Numerical results\r\nillustrate the efficiency of the techniques.",
    "author_name": "M. Sahadet Hossain, and M. M. Uddin",
    "link": "https://pure.mpg.de/rest/items/item_2169689/component/file_2246232/content",
    "month": "JUN",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "34",
    "day": "3",
    "year": "2022",
    "paper_title": "Efficient Reduced Order State Space Model Computation for a Class of Second Order Index One Systems",
    "journal_name": "PAMM",
    "short_description": "Simulation, design optimization and controller design of modern machine tools heavily rely on adequat numerical models. In order to achieve results in shorter computation times, reduced order models (ROMs) are applied in either of these tasks.",
    "long_description": "Simulation, design optimization and controller design of modern machine tools heavily rely on adequat numerical models. In order to achieve results in shorter computation times, reduced order models (ROMs) are applied in either of these tasks. Most modern simulation tools expect these ROMs to come in standard state space form. Structural models of the machine tool are however of second order type. In case piezo actuators are used in the device they are even differential algebraic equations (DAEs) of index one due to the coupling to the equations describing the electric potentials. This contribution is dedicated especially to those systems. We combine the ideas for balanced truncation model order reduction of large and sparse index 1 DAEs with methods developed for the efficient numerical handling of second order systems. (© 2012 Wiley-VCH Verlag GmbH & Co. KGaA, Weinheim)",
    "author_name": "Peter Benner, Burkhard Kranz, Jens Saak, M. M. Uddin",
    "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/pamm.201210338",
    "month": "DEC",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "35",
    "day": "15",
    "year": "2012",
    "paper_title": "Computation of a compact state space model for an adaptive spindle head configuration with piezo actuators using balanced truncation",
    "journal_name": "Production Engineering",
    "short_description": "Finite element models of machine tools or their building blocks are usually very large and thus do not allow for fast simulation or application in controller design.",
    "long_description": "Finite element models of machine tools or their building blocks are usually very large and thus do not allow for fast simulation or application in controller design. Especially when algebraic constraints come into play the models become differential algebraic equations and therefore are even more difficult to handle in the application. In this contribution we propose a method based on modern system theoretic model order reduction algorithms that allows to generate a first order standard state space reduced order model for a structural model of an adaptive spindle support that is of second order index 1 differential algebraic form due to the piezo actuation applied. The accuracy of the method is demonstrated by a numerical frequency domain error analysis.",
    "author_name": "M. M. Uddin, J. Saak, B. Kranz, and P. Benner",
    "link": "https://link.springer.com/article/10.1007/s11740-012-0410-x",
    "month": "SEP",
    "paper_type": "Journal",
    "project_id": null
  },
  {
    "paper_id": "36",
    "day": "17",
    "year": "2022",
    "paper_title": "Estimating Aerodynamic Data via Supervised Learning",
    "journal_name": "25th International Conference on Computer and Information Technology (ICCIT)",
    "short_description": "Supervised learning extracts a relationship between the input and the output from a training dataset. We consider four models – Support Vector Machine, Random Forest, Gradient Boost, and K-Nearest Neighbor",
    "long_description": "Supervised learning extracts a relationship between the input and the output from a training dataset. We consider four models – Support Vector Machine, Random Forest, Gradient Boost, and K-Nearest Neighbor – and employ them on data pertaining to airfoils in two different cases. First, given data about several different airfoil configurations, our objective is to predict the aerodynamic coefficients of a new airfoil at different angles of attack. Second, we seek to investigate how the coefficients can be estimated for a specific airfoil if the Reynolds number dramatically changes. It is our finding that the Random Forest and the Gradient Boost show promising performance in both the scenarios.",
    "author_name": "Azizul Haque, Md. Tanzim Hossain, Mohammad N. Murshed, Kife Intasar Bin Iqbal, and M. M. Uddin",
    "link": "https://ieeexplore.ieee.org/abstract/document/10054896",
    "month": "DEC",
    "paper_type": "Conferences",
    "project_id": null
  },
  {
    "paper_id": "37",
    "day": "17",
    "year": "2020",
    "paper_title": "Stability Preservation of Frequency-Limited Balancing Based Reduced Order Model of Large Scale Index-1 Descriptor System",
    "journal_name": "11th International Conference on Electrical and Computer Engineering (ICECE)",
    "short_description": "This paper discusses on the stability preservation technique of the frequency limited balanced reduced order model of a class of large-scale sparse descriptor system.",
    "long_description": "This paper discusses on the stability preservation technique of the frequency limited balanced reduced order model of a class of large-scale sparse descriptor system. For this purpose, firstly we modify standard rational Krylov subsapce method (RKSM) for solving frequency-limited Lyapunov equation pair to find out low-rank Gramian factors what is necessary to apply in balanced truncation technique. Next, we construct two projector matrices, and project the balanced unstable reduced system matrices found after implementing balanced truncation technique to ensure stability. Several data of index-1 descriptor system models are nominated for numerical experiments to demonstrate the efficiency of the proposed technique.",
    "author_name": "Kife I. Bin Iqbal, M. M. Uddin and M. Forhad Uddin",
    "link": "https://ieeexplore.ieee.org/abstract/document/9393106",
    "month": "DEC",
    "paper_type": "Conferences",
    "project_id": "1"
  },
  {
    "paper_id": "38",
    "day": "19",
    "year": "2020",
    "paper_title": "Low rank approximation of the turbulent channel flow by filter-reinforced Dynamic Mode Decomposition",
    "journal_name": "23rd International Conference on Computer and Information Technology (ICCIT)",
    "short_description": "Dynamic Mode Decomposition (DMD) is a data-driven modeling tool that can create a model from time-series data of a quantity of interest in a particular problem.",
    "long_description": "Dynamic Mode Decomposition (DMD) is a data-driven modeling tool that can create a model from time-series data of a quantity of interest in a particular problem. We propose a new version of DMD to efficiently identify the modes in the complex turbulent channel flow. This modified version employs Discrete Fourier Transform to remove the low-amplitude high-frequency content in the images and results in a spectrum that shows the most dominant modes that contribute to the evolution of the flow.",
    "author_name": "N. Murshed and M. M. Uddin",
    "link": "https://ieeexplore.ieee.org/abstract/document/9392659",
    "month": "DEC",
    "paper_type": "Conferences",
    "project_id": null
  },
  {
    "paper_id": "39",
    "day": "19",
    "year": "2020",
    "paper_title": "In search of frequency-limited low-rank Gramian factors for the balancing based model reduction of large-scale sparse descriptor system",
    "journal_name": "23rd International Conference on Computer and Information Technology (ICCIT)",
    "short_description": "his paper discusses frequency limited balanced truncation of a class of large-scale sparse descriptor system by preserving the sparsity of the system.",
    "long_description": "This paper discusses frequency limited balanced truncation of a class of large-scale sparse descriptor system by preserving the sparsity of the system. For this purpose we compute the low-rank Gramian factors by solving the frequency limited Lyapunov equations. We modify the standard rational Krylov subspace method (RKSM) for solving the Lyapunov equations efficiently and implicitly. Several data of index-l descriptor system models are nominated for numerical experiments to demonstrate the efficiency of the proposed techniques.",
    "author_name": "Kife I. Bin Iqbal, M. M. Uddin and M. Forhad Uddin",
    "link": "https://ieeexplore.ieee.org/abstract/document/9392667",
    "month": "DEC",
    "paper_type": "Conferences",
    "project_id": "1"
  },
  {
    "paper_id": "40",
    "day": "18",
    "year": "2019",
    "paper_title": "Time delay coordinate based Dynamic Mode Decomposition of a compressible signal",
    "journal_name": "22nd International Conference on Computer and Information Technology (ICCIT)",
    "short_description": "Dynamic Mode Decomposition (DMD) is a data-driven modeling technique used to extract dynamic features in a complex physical system.",
    "long_description": "Dynamic Mode Decomposition (DMD) is a data-driven modeling technique used to extract dynamic features in a complex physical system. We review the algorithm and establish its connection to the Koopman operator. DMD fails to work on problems where the data has a highly oscillatory flow. Time delay coordinates have been used as a modification in the DMD algorithm and is tested on data acquired from a compressible signal. This version of DMD perfectly captures the dynamics and results in a reliable model for future prediction.",
    "author_name": "Mohammad N. Murshed and M. M. Uddin",
    "link": "https://ieeexplore.ieee.org/abstract/document/9038561",
    "month": "DEC",
    "paper_type": "Conferences",
    "project_id": null
  },
  {
    "paper_id": "41",
    "day": "5",
    "year": "2019",
    "paper_title": "An Analysis on Python Programming Language Demand and Its Recent Trend in Bangladesh",
    "journal_name": "Aaquib Javed, M. M. Uddin",
    "short_description": "In today's world, we have a lot of programming languages. Which can realize our needs, but the important issue is, how to teach programming language in a very effective way to freshmen.",
    "long_description": "In today's world, we have a lot of programming languages. Which can realize our needs, but the important issue is, how to teach programming language in a very effective way to freshmen. Well, in that case, python can be a suitable language for both learning and real-world programming. It is a high-level, object-oriented programming language created by Guido Van Rossum was released in 1991. After python released day by day, it has become one of the most famous and demanding programming languages all over the world. In this paper will introduce and discuss python programming characteristics / features, organized syntax, and its powerful tools which help to solve many tasks also it is very close to simple math thinking. We tried to find out the recent trend/demand for python programming language in Bangladesh by operated a survey under faculty member from various universities, freelancer programmers and students from engineering studies. Also, make some simple comparison between python and other languages. From there we have figure out the most demanding features, characteristics of python language and the types of programming language supported by python. Python is now the most demanded and fastest-growing language which is founded by the support of researches done over many articles of various magazines and popular websites.",
    "author_name": "22nd International Conference on Computer and Information Technology (ICCIT)",
    "link": "https://dl.acm.org/doi/abs/10.1145/3373509.3373540",
    "month": "OCT",
    "paper_type": "Conferences",
    "project_id": null
  },
  {
    "paper_id": "42",
    "day": "26",
    "year": "2019",
    "paper_title": "Riccati based optimal control for linear quadratic regulator problems",
    "journal_name": "5th International Conference on Advances in Electrical Engineering 2019 (ICAEE 2019)",
    "short_description": "he computational approach to the continuous algebraic Riccati equations arise from large-scale power system with various components, are time expensive with the inaccurate rate of convergence.",
    "long_description": "The computational approach to the continuous algebraic Riccati equations arise from large-scale power system with various components, are time expensive with the inaccurate rate of convergence. In this article, attention is mainly focused on finding Riccati based optimal control for linear quadratic regulator problem subject to the time-invariant continuous-time linear system applying rational Krylov subspace method. A novel algorithm is proposed to solve very large Riccati equation by means of nested iterative techniques. The computations will allow the sparsity pattern and can be applied within closed-loop simulations.",
    "author_name": "Mahtab Uddin, M. A. Hakim Khan, and M. M. Uddin",
    "link": "https://ieeexplore.ieee.org/abstract/document/8975637",
    "month": "SEP",
    "paper_type": "Conferences",
    "project_id": null
  },
  {
    "paper_id": "43",
    "day": "18",
    "year": "2019",
    "paper_title": "Efficient computation of Riccati-based optimal control for power system models",
    "journal_name": "22nd International Conference on Computer and Information Technology (ICCIT)",
    "short_description": "The computational technique for solving continuous algebraic Riccati equations governed from a very large dimensional power system with sophisticated ingredients requires highly expensive time dealings and invade by the infeasible rate of convergence.",
    "long_description": "The computational technique for solving continuous algebraic Riccati equations governed from a very large dimensional power system with sophisticated ingredients requires highly expensive time dealings and invade by the infeasible rate of convergence. The aim of the work is mainly focused on acquiring the optimal control for the large-scale power system model and stabilizing the corresponding system through the Riccati based feedback stabilization. To achieve the desired goal, a nested iterative Kleinman-Newton (K-N) method is proposed by means of Alternative Direction Implicit (ADI) technique. The proposed algorithm will allow the structure-preserving simulations and can be efficiently applied to the perturbed systems with proper adaptation.",
    "author_name": "Mahtab Uddin, M. A. Hakim Khan, and M. M. Uddin",
    "link": "https://ieeexplore.ieee.org/abstract/document/9038442",
    "month": "DEC",
    "paper_type": "Conferences",
    "project_id": null
  },
  {
    "paper_id": "44",
    "day": "7",
    "year": "2019",
    "paper_title": "Reduced Model Based Feedback Stabilization of Large-scale Sparse Power System Model",
    "journal_name": "2019 International conference on Electrical, Computer and Communication Engineering (ECCE )",
    "short_description": "Linearizing a power system model around the equilibrium point we may obtain unstable large-scale sparse differential-algebraic equations (DAEs) with index 1 form.",
    "long_description": "Linearizing a power system model around the equilibrium point we may obtain unstable large-scale sparse differential-algebraic equations (DAEs) with index 1 form. Riccati-based feedback stabilization of such large-scale unstable system is a challenging task. This paper shows that the Riccati-based feedback stabilization matrix for the original unstable system can be computed efficiently from the reduced order state space system. For this purpose we apply the balanced truncation (BT) to the large-scale unstable index 1 DAEs for reduced-order state space model. To implement the BT, we efficiently solve two Lyapunov equations with respect to the Bernoulli stabilized system. The efficiency of the proposed technique is tested by applying to a data set of Brazilian power system model.",
    "author_name": "S. Hasan, A. M. Fony and M. M. Uddin",
    "link": "https://ieeexplore.ieee.org/abstract/document/8679174",
    "month": "FEB",
    "paper_type": "Conferences",
    "project_id": null
  },
  {
    "paper_id": "45",
    "day": "2",
    "year": "2019",
    "paper_title": "Optimal Control of Sensor Based Human Arm Motion and Gesture Replication System",
    "journal_name": "2019 IEEE Conference on Systems, Process and Control (ICSPC)",
    "short_description": "Optimal control stabilization of the Human arm motion and gesture replication system plays a vital role in achieving the desired characteristics of the system, especially, for minimizing the time delay as well as removing any undesired oscillations.",
    "long_description": "Optimal control stabilization of the Human arm motion and gesture replication system plays a vital role in achieving the desired characteristics of the system, especially, for minimizing the time delay as well as removing any undesired oscillations. The conventional system showed the instability in the output response after operating for a long time. However, Linear Quadratic Regulator (LQR) and State Feedback control techniques have optimally controlled the system and overcome this instability. The transient analysis for both the methods showed that State Feedback method decreased the instability to a fair degree even though some oscillation exists just before reaching stability. On the other hand, LQR technique completely removed the oscillation from the system's response due to the shifting of poles to the left half plane. Therefore, LQR is the best suited control technique for achieving an optimal controlled system.",
    "author_name": "S. Amir, M. S. Kamal, M. M. Uddin, K. M. A. Salam",
    "link": "https://ieeexplore.ieee.org/abstract/document/8837084",
    "month": "AUG",
    "paper_type": "Conferences",
    "project_id": null
  },
  {
    "paper_id": "46",
    "day": "27",
    "year": "2018",
    "paper_title": "K-cyclic Smith iterative method for model reduction of index-2 periodic control systems",
    "journal_name": "2018 International Conference on Innovations in Science, Engineering and Technology (ICISET)",
    "short_description": "In this paper, we present a structure preserving Smith based iterative method for the model order reduction of index-2 periodic descriptor systems.",
    "long_description": "In this paper, we present a structure preserving Smith based iterative method for the model order reduction of index-2 periodic descriptor systems. The work of this paper is twofold. The first half of our work focuses on reformulating a discrete-time descriptor system into a discrete-time generalized system by manipulating the system structure. Once the transformed generalized system is obtained, it is expressed in a cyclic lifted representation to make it into the framework for balanced truncation-based model order reduction. The latter half of our work is dedicated to the application of our proposed Smith based algorithm to estimate the solutions of the lifted discrete-time algebraic Lyapunov equations (LDALEs) associated with the system. Cyclic permutation strategies are employed in our proposed algorithm which allows us to hold onto the original block diagonal structure of the solution in the iterative computations. The efficiency and accuracy of our proposed algorithm is verified using results obtained from numerical simulations.",
    "author_name": "E. H. Khan, M. S. Hossain, S. G. Omar, A. Tahsin and M. M. Uddin",
    "link": "https://ieeexplore.ieee.org/abstract/document/8745602",
    "month": "OCT",
    "paper_type": "Conferences",
    "project_id": null
  },
  {
    "paper_id": "47",
    "day": "6",
    "year": "2017",
    "paper_title": "Solution of Large-Scale Lyapunov Matrix Equations for PDEG Based Model Reduction of Structured Dynamical Systems",
    "journal_name": "6th  International Conference on ‘Computing, Communication and Sensor Networks, (CCSN2017)",
    "short_description": "In the Gramian based model order reduction, computing\r\nthe Gramian factors by solving the Lyapunov equations is\r\none of the crucial tasks.",
    "long_description": "In the Gramian based model order reduction, computing\r\nthe Gramian factors by solving the Lyapunov equations is\r\none of the crucial tasks. Recently, the rational Krylov\r\nsubspace method (RKSM) is recognized as one of the\r\nmost efficient methods to compute the low-rank Gramian\r\nfactors by solving the Lyapunov equations. In this paper,\r\nwe discuss the RKSM for computing the low-rank factors\r\nof the Gramian by solving the Lyapunov equations arising\r\nfrom the structured dynamical systems. The computed\r\nGramian factors will be applied to the PDEG (projection\r\nonto the dominant eigenspace of the Gramian) based\r\nmodel order reduction which preserves the structure of\r\nthe original dynamical systems. Numerical experiments\r\nare provided to illustrate and assess the efficiency of the\r\nproposed method.",
    "author_name": "S. Hassan and M. M. Uddin",
    "link": "https://www.researchgate.net/profile/Shazzad-Hasan/publication/322910315_Solution_of_Large-Scale_Lyapunov_Matrix_Equations_for_PDEG_Based_Model_Reduction_of_Structured_Dynamical_Systems/links/60057db4",
    "month": "JUN",
    "paper_type": "Conferences",
    "project_id": null
  },
  {
    "paper_id": "48",
    "day": "16",
    "year": "2017",
    "paper_title": "Structure preserving model order reduction using the projection onto the dominant eigen-space of the Gramian (PDEG)",
    "journal_name": "International Conference on Electrical, Computer and Communication Engineering (ECCE)",
    "short_description": "Recently, second-order-to-second-order structure preserving model order reduction (MOR) has received a lot of attention. One of the most prominent techniques of such MOR is balanced truncation (BT).",
    "long_description": "Recently, second-order-to-second-order structure preserving model order reduction (MOR) has received a lot of attention. One of the most prominent techniques of such MOR is balanced truncation (BT). In general, this method does not preserve some essential properties of the system; such as stability and symmetry. This article discusses a new projection method for structure preserving model reduction of second-order systems via projecting the system onto the dominant eigen-space of the Gramians of the systems. The proposed method preserves the stability and symmetry of the systems. Numerical experiments are discussed to show the efficiency of the proposed technique.",
    "author_name": "M. M. Uddin",
    "link": "https://ieeexplore.ieee.org/abstract/document/7912905",
    "month": "FEB",
    "paper_type": "Conferences",
    "project_id": null
  },
  {
    "paper_id": "49",
    "day": "20",
    "year": "2016",
    "paper_title": "Rational Krylov subspace method (RKSM) for solving the Lyapunov equations of index-1 descriptor systems and application to balancing based model reduction",
    "journal_name": "2016 9th International Conference on Electrical and Computer Engineering (ICECE)",
    "short_description": "This paper focuses on the iterative method for solving Lyapunov equations to compute the low-rank Gramian factors. Such Lyapunov equations arise from large-scale sparse index-1 descriptor system.",
    "long_description": "This paper focuses on the iterative method for solving Lyapunov equations to compute the low-rank Gramian factors. Such Lyapunov equations arise from large-scale sparse index-1 descriptor system. The technique is mainly based on rational Krylov subspace method (RKSM) which is introduced in [1]. However, there the proposed technique is applicable for the standard state space model. Here, we extend this idea for index-1 descriptor system to compute the low-rank Gramian factors. The Gramian factors are then applied to the balancing based model reduction to reduce the complexity of the underlying system. Several test examples are considered to show the efficiency of the proposed method numerically.",
    "author_name": "M. M. Uddin, M. Sumon Hossain, Mohammad Forhad Uddin",
    "link": "https://ieeexplore.ieee.org/abstract/document/7853954",
    "month": "DEC",
    "paper_type": "Conferences",
    "project_id": null
  },
  {
    "paper_id": "50",
    "day": "18",
    "year": "2016",
    "paper_title": "Reduced-order modeling of index-1 vibrational systems using interpolatory projections",
    "journal_name": "2016 International Conference On Computer and Information Technology (ICCIT)",
    "short_description": "Large sparse second order index-1 descriptor systems arise in various disciplines of science and engineering, such as constraint mechanics or multibody dynamics, mechatronics (where mechanical and electrical elements are coupled), but also RLC circuit design.",
    "long_description": "Large sparse second order index-1 descriptor systems arise in various disciplines of science and engineering, such as constraint mechanics or multibody dynamics, mechatronics (where mechanical and electrical elements are coupled), but also RLC circuit design. Simulation, controller design and design optimization are only some applications of such models. Either of these tasks, just like any other many-query situation becomes unfeasible when the system is high dimensional. This paper discusses an algorithm to obtain a reduced state space model of a large sparse second order index-1 system using an interpolatory projection method based on the iterative rational Krylov algorithm (IRKA). In each iteration of this algorithm, we need to solve a number of linear systems. The main contribution of this paper is to solve these linear systems by exploiting the sparsity of the original model, which reduces the computational cost drastically. The algorithm is applied to a micro-mechanical piezo-actuated structural FEM model of a certain building block of a machine tool. Numerical experiments with a complex 3d model of an adaptive spindle support (a piezo-mechanical multiphysics system) show the effectivity and efficiency of the techniques.",
    "author_name": "P. Benner, J. Saak and M. M. Uddin",
    "link": "https://ieeexplore.ieee.org/abstract/document/7860183",
    "month": "DEC",
    "paper_type": "Conferences",
    "project_id": null
  },
  {
    "paper_id": "51",
    "day": "14",
    "year": "2013",
    "paper_title": "odellreduktion fr strukturierte Index-3-Systeme",
    "journal_name": "2013 Tagungsband des GMA-Fachausschusses 1.30, Modellbildung, Identifikation und Simulation in der Automatisierungstechnik Technische Universit ?t Darmstadt, Institut fo ?r Automatisierungstechnik und Mechatronik",
    "short_description": "",
    "long_description": "",
    "author_name": "J. Saak, M. M. Uddin and M. Voigt",
    "link": null,
    "month": "JUN",
    "paper_type": "Conferences",
    "project_id": null
  },
  {
    "paper_id": "52",
    "day": "20",
    "year": "2012",
    "paper_title": "Second order to second order balancing for index-1 vibrational systems",
    "journal_name": "2012 International Conference on Electrical and Computer Engineering (ICECE)",
    "short_description": "Linearizing constraint equations of motion around equilibrium points in mechanics or coupling electrical and mechanical parts in mechatronics one obtains large sparse second-order index-1 differential algebraic (DAE) models.",
    "long_description": "Linearizing constraint equations of motion around equilibrium points in mechanics or coupling electrical and mechanical parts in mechatronics one obtains large sparse second-order index-1 differential algebraic (DAE) models. To get reduced order models of such systems, first they can be rewritten into first-order models. Then, model reduction techniques are applied to these first order representations to get a reduced first-order index-1 or standard state space model. Unfortunately, it is not possible to go back to second order formulation from these reduced systems, though it is often desirable to work with second order surrogate models. In this paper, we present algorithms to retrieve reduced index-1 DAE or standard second order ODE systems and apply these to a micro-mechanical piezo-actuated structural FEM model of a certain building block of a machine tool. Numerical results illustrate the efficiency of the techniques.",
    "author_name": "P. Benner, J. Saak and M. M. Uddin",
    "link": "https://ieeexplore.ieee.org/abstract/document/6471704",
    "month": "DEC",
    "paper_type": "Conferences",
    "project_id": null
  },
  {
    "paper_id": "53",
    "day": "16",
    "year": "2017",
    "paper_title": "Structure preserving model order reduction using the projection onto the dominant Eigen-space of the Gramian (PDEG)",
    "journal_name": "International conference on Electrical, Computer and Communication Engineering (ECCE)",
    "short_description": "",
    "long_description": "",
    "author_name": "M. M. Uddin",
    "link": null,
    "month": "FEB",
    "paper_type": "Poster Presentation",
    "project_id": null
  },
  {
    "paper_id": "54",
    "day": "12",
    "year": "2014",
    "paper_title": "Model Order Reduction for Structured Second Or-der DAE System",
    "journal_name": "Workshop on Non-linear Model Order Reduction 2014, Schloss Ringberg Tegernsee, Germany",
    "short_description": "",
    "long_description": "",
    "author_name": "M. I. Ahmad, J. Saak, M. M. Uddin and M. Voigt",
    "link": null,
    "month": "JUN",
    "paper_type": "Poster Presentation",
    "project_id": null
  },
  {
    "paper_id": "55",
    "day": "25",
    "year": "2014",
    "paper_title": "Balanced Truncation for unstable linearized Navier-Stokes Systems",
    "journal_name": "Workshop on Non-linear Model Order Reduction 2014, Schloss Ringberg Tegernsee, Germany",
    "short_description": "",
    "long_description": "",
    "author_name": "J. Saak and M. M. Uddin",
    "link": null,
    "month": "JUN",
    "paper_type": "Poster Presentation",
    "project_id": null
  },
  {
    "paper_id": "56",
    "day": "30",
    "year": "2015",
    "paper_title": "Computational Methods for Model Reduction of Large-Scale Sparse Structured Descriptor Systems",
    "journal_name": "PhD Thesis",
    "short_description": "Currently descriptor systems, i.e., the systems whose dynamics obey differentialalgebraic equations (DAEs), play important roles in various disciplines of science\r\nand technology",
    "long_description": "Currently descriptor systems, i.e., the systems whose dynamics obey differentialalgebraic equations (DAEs), play important roles in various disciplines of science\r\nand technology. In general, such systems are generated by finite element or finite\r\ndifference methods. If the grid resolution becomes very fine, because many details\r\nmust be resolved, the systems become very large. Moreover they are sparse, i.e.,\r\nmost of the elements in the matrices of the system are zero, which are not stored. A\r\nhigh dimensional system will always be complex, requiring a great deal of memory,\r\nthereby hindering computational performance significantly in simulation. Sometimes the systems are too large to store due to memory restrictions. Therefore,\r\nwe seek to reduce the complexity of the model by applying model order reduction\r\n(MOR), i.e., we seek an approximation of the original model that well-approximates\r\nthe behavior of the original model, yet is much faster to evaluate. We investigate\r\nefficient model reduction of sparse large-scale descriptor systems. We focus on\r\nthe balancing based method balanced truncation (BT). A balanced truncation based\r\nmethod for such systems is introduced by Stykel (see, e.g., her PhD thesis, published in 2002). The author discusses a general framework of the BT method for a\r\ndescriptor system. In general, the method is based on explicit computation of the\r\nspectral projectors onto the left and right deflating subspaces of the matrix pencil\r\ncorresponding to the finite and infinite eigenvalues. Although these projectors are\r\navailable for particular systems, computation is expensive. In this thesis, we focus\r\non how to avoid computing such kind of projectors explicitly. Besides balanced\r\ntruncation, the idea of avoidance of the projectors is extended to interpolation of\r\ntransfer function, via iterative rational Krylov algorithms (IRKA) and projection onto\r\ndominant eigenspace, of the Gramian (PDEG) based model reduction methods. First,\r\nwe discuss the model reduction problem for index 2 first order unstable descriptor\r\nsystems arising from spatially discretized linearized Navier-Stokes equations. We\r\napply our algorithms to the linearization of the von Kármán vortex shedding at a\r\nmoderate Reynolds number. We demonstrate that the resulting reduced model can\r\nbe used to accurately simulate the unstable linearized model and to design a stabilizing controller. Future work will include the realization of the resulting control\r\nlaw for the full nonlinear model. Second, we investigate model reduction of a finite\r\nelement model of a spindle head configuration in a machine tool. The special feature of this spindle head is that it is partially driven by a set of piezo actuators. Due to this piezo actuation, the resulting model is a second order differential-algebraic\r\nsystem of index 1. We develop algorithms for both second-order-to-first-order and\r\nsecond-order-to-second-order reduction methods. We prove the real world capability of our methods in application to a very large-scale sparse FEM model of an\r\nadaptive spindle support employing piezo actuators. Finally, we focus on the model\r\nreduction of DAE systems with mechanical applications. In the constraint mechanics or multibody dynamics, the linearized equation of motion with holonomic constraints leads to second order index 3 descriptor systems. We develop efficient\r\ntechniques to obtain second-order-to-first-order and second-order-to-second-order\r\nreduced models of such index 3 descriptor systems. The efficiency of the techniques is tested by applying them to several test examples. For implementing the\r\nBT and PDEG methods, we need to compute approximate low rank Gramian factors of the system by solving two continuous-time Lyapunov equations. Recently\r\none of the most powerful methods to compute these Gramian factors for largescale sparse dynamical systems is the low-rank Cholesky factor alternating direction\r\nimplicit (LRCF-ADI) iteration. We also present updated versions of the LRCF-ADI\r\nmethod to solve the Lyapunov equations arising from descriptor systems. Moreover,\r\nseveral approaches for computing ADI shift parameters are discussed and proposed\r\nfor an improvement of an existing method.",
    "author_name": "M. M. Uddin",
    "link": "https://pure.mpg.de/pubman/faces/ViewItemOverviewPage.jsp?itemId=item_2164133",
    "month": "JUN",
    "paper_type": "Theses",
    "project_id": null
  },
  {
    "paper_id": "57",
    "day": "15",
    "year": "2011",
    "paper_title": "Model Reduction for Piezo-Mechanical Systems using Balanced Truncation",
    "journal_name": "Masters Thesis",
    "short_description": "In today’s scientific and technological world, physical and artificial processes are often described by mathematical models which can be used for\r\nsimulation, optimization or control.",
    "long_description": "In today’s scientific and technological world, physical and artificial processes are often described by mathematical models which can be used for\r\nsimulation, optimization or control. As the mathematical models get more\r\ndetailed and different coupling effects are required to include, usually the\r\ndimension of these models become very large. Such large-scale systems\r\nlead to large memory requirements and computational complexity. To handle these large models efficiently in simulation, control or optimization\r\nmodel order reduction (MOR) is essential. The fundamental idea of model\r\norder reduction is to approximate a large-scale model by a reduced model\r\nof lower state space dimension that has the same (to the largest possible\r\nextent) input-output behavior as the original system. Recently, the systemtheoretic method ”Balanced Truncation (BT)”, which was believed to be\r\napplicable only to moderately sized problems, has been adapted to really\r\nlarge-scale problems. Moreover, it also has been extended to so-called descriptor systems, i.e., systems whose dynamics obey differential-algebraic\r\nequations. In this thesis, a BT algorithm is developed for MOR of index-1\r\ndescriptor systems based on several papers from the literature. It is then applied to the setting of a piezo-mechanical system. The algorithm is verified\r\nby real-world data describing micro-mechanical piezo-actuators. Several\r\nnumerical experiments are used to illustrate the efficiency of the algorithm.",
    "author_name": "M. M. Uddin",
    "link": "https://www.researchgate.net/publication/216266059_Model_Reduction_for_Piezo-Mechanical_Systems_using_Balanced_Truncation",
    "month": "APR",
    "paper_type": "Theses",
    "project_id": null
  },
  {
    "paper_id": "58",
    "day": "25",
    "year": "2019",
    "paper_title": "Computational Techniques for Structure Preserving Model Reduction of Constrain Dynamical Models",
    "journal_name": "International Joint Conference on Computational Intelligence, University of Liberal Arts Bangladesh 2019",
    "short_description": "",
    "long_description": "",
    "author_name": "M. M. Uddin",
    "link": null,
    "month": "OCT",
    "paper_type": "Talks & Presentations",
    "project_id": "2"
  },
  {
    "paper_id": "59",
    "day": "7",
    "year": "2019",
    "paper_title": "Reduced Model Based Feedback Stabilization of Large-scale Sparse Power System Model",
    "journal_name": "International conference on Electrical, Computer and Communication Engineering (ECCE ) 2019",
    "short_description": "",
    "long_description": "",
    "author_name": "M. M. Uddin",
    "link": null,
    "month": "FEB",
    "paper_type": "Talks & Presentations",
    "project_id": null
  },
  {
    "paper_id": "60",
    "day": "16",
    "year": "2017",
    "paper_title": "Structure preserving model order reduction using the projection onto the dominant Eigen-space of the Gramian (PDEG)",
    "journal_name": "International conference on Electrical, Computer and Communication Engineering (ECCE)",
    "short_description": "",
    "long_description": "",
    "author_name": "M. M. Uddin",
    "link": null,
    "month": "FEB",
    "paper_type": "Talks & Presentations",
    "project_id": null
  },
  {
    "paper_id": "61",
    "day": "20",
    "year": "2016",
    "paper_title": "Rational Krylov subspace method (RKSM) for solving the Lyapunov equations of index-1 descriptor systems and application to balancing based model reduction",
    "journal_name": "9th International Conference on Electrical and Computer Engineering (ICECE) 2016",
    "short_description": "",
    "long_description": "",
    "author_name": "M. M. Uddin",
    "link": null,
    "month": "DEC",
    "paper_type": "Talks & Presentations",
    "project_id": null
  },
  {
    "paper_id": "62",
    "day": "18",
    "year": "2016",
    "paper_title": "Reduced-order modeling of index-1 vibrational systems using interpolatory projections",
    "journal_name": "19th International Conference On Computer and Information Technology (ICCIT) 2016",
    "short_description": "",
    "long_description": "",
    "author_name": "M. M. Uddin",
    "link": null,
    "month": "DEC",
    "paper_type": "Talks & Presentations",
    "project_id": null
  },
  {
    "paper_id": "63",
    "day": "20",
    "year": "2015",
    "paper_title": "Two Competitive techniques for Reduced State Space Modeling of Time-Invariant Large-Scale Continuous-Time stems",
    "journal_name": "19th International Math Conference 2015, Dhaka",
    "short_description": "",
    "long_description": "",
    "author_name": "M. M. Uddin",
    "link": null,
    "month": "DEC",
    "paper_type": "Talks & Presentations",
    "project_id": null
  },
  {
    "paper_id": "64",
    "day": "23",
    "year": "2014",
    "paper_title": "Balancing Based Model Reduction of Unstable Descriptor Systems",
    "journal_name": "7th IMPRS Workshop 2014, Wernigerode",
    "short_description": "",
    "long_description": "",
    "author_name": "M. M. Uddin",
    "link": null,
    "month": "APR",
    "paper_type": "Talks & Presentations",
    "project_id": null
  },
  {
    "paper_id": "65",
    "day": "8",
    "year": "2013",
    "paper_title": "Dimension Reduction of Large-Sparse Second Order Descriptor Systems",
    "journal_name": "6th IMPRS Workshop 2013, Wittenberg",
    "short_description": "",
    "long_description": "",
    "author_name": "M. M. Uddin",
    "link": null,
    "month": "APR",
    "paper_type": "Talks & Presentations",
    "project_id": null
  },
  {
    "paper_id": "66",
    "day": "20",
    "year": "2012",
    "paper_title": "Second Order to Second Order Balancing for Index-1 Vibrational Systems",
    "journal_name": "7th International Conference on Electrical & Computer Engineering (ICECE)",
    "short_description": "",
    "long_description": "",
    "author_name": "M. M. Uddin",
    "link": null,
    "month": "DEC",
    "paper_type": "Talks & Presentations",
    "project_id": null
  },
  {
    "paper_id": "67",
    "day": "18",
    "year": "2012",
    "paper_title": "Efficient Methods for Reduced Order State Space Modeling of Piezo-Mechanical Systems",
    "journal_name": "GAMM Work-shops 2012: Dynamics and Control, Anif/Salzburg, Austria",
    "short_description": "",
    "long_description": "",
    "author_name": "M. M. Uddin",
    "link": null,
    "month": "SEP",
    "paper_type": "Talks & Presentations",
    "project_id": null
  },
  {
    "paper_id": "68",
    "day": "7",
    "year": "2012",
    "paper_title": "Model Reduction of Mechanical Systems with Piezo Actuators Using Balanced Truncation",
    "journal_name": "CSC seminar, MPI Magdeburg, Magdeburg, Germany",
    "short_description": "",
    "long_description": "",
    "author_name": "M. M. Uddin",
    "link": null,
    "month": "FEB",
    "paper_type": "Talks & Presentations",
    "project_id": null
  },
  {
    "paper_id": "69",
    "day": "29",
    "year": "2011",
    "paper_title": "Model Reduction for Piezo-mechanical Systems Using Balanced Truncation",
    "journal_name": "Stockholm University, Stockholm, Sweden",
    "short_description": "",
    "long_description": "",
    "author_name": "M. M. Uddin",
    "link": null,
    "month": "APR",
    "paper_type": "Talks & Presentations",
    "project_id": null
  },
  {
    "paper_id": "70",
    "day": "15",
    "year": "2011",
    "paper_title": "Model Reduction for Piezo-Mechanical Systems Using Balanced Truncation",
    "journal_name": "QUCOSA, Germany",
    "short_description": "",
    "long_description": "",
    "author_name": "M. M. Uddin",
    "link": null,
    "month": "NOV",
    "paper_type": "Others",
    "project_id": null
  },
  {
    "paper_id": "71",
    "day": "5",
    "year": "2009",
    "paper_title": "Solution of Ordinary Differential Equations by Runge-Kutta Methods",
    "journal_name": "ASA University Review, Vol. 3 , pp. 699–700",
    "short_description": "",
    "long_description": "",
    "author_name": "M. N. Uddin, M. M. Uddin and N. K. Mitra",
    "link": null,
    "month": "APR",
    "paper_type": "Others",
    "project_id": null
  },
  {
    "paper_id": "72",
    "day": "28",
    "year": "2021",
    "paper_title": "ERROR MINIMIZATION OF REDUCED MODELS OF LARGE-SCALE SYSTEMS BY SOLVING TIME AND FREQUENCY RESTRICTED LYAPUNOV EQUATIONS",
    "journal_name": "Master’s thesis, Buet",
    "short_description": "The usage of mathematical models of physical systems are increasing day by day in various\r\ndisciplines of science and engineering for simulation, optimization, or control. Descriptor systems\r\nis a special kind of formation of physical systems arisen in many practical oriented fields whose\r\ndynamics maintain Differential- Algebraic Equations.",
    "long_description": "The usage of mathematical models of physical systems are increasing day by day in various\r\ndisciplines of science and engineering for simulation, optimization, or control. Descriptor systems\r\nis a special kind of formation of physical systems arisen in many practical oriented fields whose\r\ndynamics maintain Differential- Algebraic Equations. Such type of systems are originated by\r\nfinite elements or difference methods which becomes huge and complex to analyze along with the\r\nincrement of the fineness of the grid resolution. As a result, the necessity of model order reduction\r\ncomes up in order to minimize the complexity of the models during controlling by preserving the\r\ninput-output relation of the original large-scale models. However, although reducing the dimension\r\nof large-scale models on infinite time and frequency domains has a great theoretical significance,\r\nthe reduced order models of original large-scale models on restricted time and frequency intervals\r\nare more demandable to the analyzers and engineers for practical investigation.\r\nThis dissertation elaborately discusses the model generations for data extraction to form the\r\nlarge-scale state-space systems and the projection based techniques to calculate the approximate\r\nlow-rank solutions of the original state-space systems on definite time and frequency intervals.\r\nWe impose relevant governing equations to create physical as well as data models. Balanced\r\ntruncation is one of the most notable methods for the reduction of the model dimensions of\r\nlinear time-invariant systems which requires computing the numerical solutions of two Lyapunov\r\nequations, commonly known as Gramians. Among some widely used approaches, Rational Krylov\r\nSubspace Method is one of the most effective procedures for finding the Gramians of the Lyapunov\r\nequations of the large-scale sparse dynamical systems which has already been developed to\r\ncompute the low-rank time and frequency indefinite solutions. Besides, it has been also reformed\r\nto compute the low-rank approximation of the standard Lyapunov equations on limited time and\r\nfrequency intervals for small-dense state-space systems.",
    "author_name": "Kife I. Bin Iqbal",
    "link": "http://lib.buet.ac.bd:8080/xmlui/bitstream/handle/123456789/5919/Full%20Thesis.pdf",
    "month": "AUG",
    "paper_type": "Theses",
    "project_id": "1"
  },
  {
    "paper_id": "73",
    "day": "6",
    "year": "2021",
    "paper_title": "Computational techniques for riccati-based feedback stabilization of large-scale sparse index-2 descriptor system",
    "journal_name": "Master’s thesis, Buet",
    "short_description": "This thesis mainly focuses on computational techniques applied to stabilize unstable Navier-Stokes models. The models arising from the Navier stokes equation are an essential aspect in engineering applications and applied mathematics in fluid mechanics, which is significantly depends on Reynolds number (Re), and if Re?300, the corresponding model will be unstable.",
    "long_description": "This thesis mainly focuses on computational techniques applied to stabilize unstable Navier-Stokes models. The models arising from the Navier stokes equation are an essential aspect in engineering applications and applied mathematics in fluid mechanics, which is significantly depends on Reynolds number (Re), and if Re?300, the corresponding model will be unstable. The computation steps are designed to approximate the full models with the ROMs, find the reduced-order feedback matrices, and attain the optimal feedback matrices for stabilizing the desired Navier-Stokes models. The prime concern is exploring the Riccati-based boundary feedback stabilization of incompressible Navier-Stokes flow via Krylov subspace techniques. Since the volume of data derived from the original models is large, the feedback stabilization process through the Riccati equation is always infeasible. Therefore, a H_2 optimal model-order reduction scheme for reduced-order modeling, preserving the sparsity of the system, is required. Some conventional methods exist, but they have some adversities, such as the requirement of high computation time and memory allocation, complex matrix algebra, and uncertainty of the stability of the reduced-order models. To overcome these drawbacks, an extended form of Krylov subspace-based Two-Sided Iterative Algorithm (TSIA) is implemented to stabilize non-symmetric index-2 descriptor systems explored from unstable Navier-Stokes models. The proposed techniques are sparsity-preserving and utilize the Wilson condition to efficiently satisfy the reduced-order modeling approach through the sparse-dense Sylvester equations. To solve the desired Sylvester equations, sparsity-preserving Krylov subspaces are structured via the system of linear equations with a compact form of matrix-vector operations. Inverse projections approaches are applied to get the optimal feedback matrix from reduced-order models. To validate the efficiency of the proposed techniques, transient behaviors of the target systems are observed, incorporating the tabular and figurative comparisons with MATLAB simulations. Finally, to reveal the advancement of the proposed techniques, we compare our work with some existing results. From the tabular and graphical comparisons of the results of numerical computations, it is observed that RKSM is not applicable for the target models due to the non-symmetric structure. In contrast, TSIA can be suitably applied to solve Sparse-dense Sylvester equations for reduced-order modeling. Furthermore, by the TSIA, full models can be efficiently approximated by the corresponding ROMs with minimized H_2 error norm, and the inverse projection scheme is effective in computing the optimal feedback matrices from the reduced-order feedback matrices to stabilize the target models more efficiently than existing methods. Thus, it can be concluded that by utilizing TSIA, unstable Navier-Stokes models can be stabilized with better accuracy and less computing time.",
    "author_name": "Md. Toriqul Islam",
    "link": "http://lib.buet.ac.bd:8080/xmlui/handle/123456789/6160",
    "month": "MAR",
    "paper_type": "Theses",
    "project_id": "1"
  },
  {
    "paper_id": "74",
    "day": "9",
    "year": "2023",
    "paper_title": "Reduced Order Modeling of a Class of Descriptor System on Certain Domains with the Application to Blood Flow Through the Carotid",
    "journal_name": "SSRN",
    "short_description": "This study focuses on model order reduction for large-scale sparse index-2 descriptor systems that arise from practical problems governed by the semi-discrete Naiver Stokes equation, such as blood flow through the carotid.",
    "long_description": "This study focuses on model order reduction for large-scale sparse index-2 descriptor systems that arise from practical problems governed by the semi-discrete Naiver Stokes equation, such as blood flow through the carotid. The goal is to reduce the system’s complexity while maintaining its critical properties within a limited frequency and time interval. To achieve this, we implicitly convert the index-2 descriptor system to an equivalent ODE system and then apply the generalized H2 optimal model reduction technique on the altered system for order reduction on the restricted frequency interval. Then this idea is extended to the order reduction in the definite time interval. The main challenge in this approach is to efficiently solve two Sylvester equations obtained from the index-2 descriptor system. We implicitly discuss the efficient solution technique of these Sylvester equation pairs and propose a method based on the Iterative Rational Krylov Algorithm for computing the large-scale matrix logarithm to deal with the significant computational challenge efficiently. To validate the proposed techniques, the authors perform numerical experiments on generated and some existing data of index-2 descriptor systems using the MATLAB interface. The results demonstrate the approximation accuracy and computational efficiency of the proposed techniques.",
    "author_name": "Kife I. Bin Iqbal, Xin Du, Mohammad Monir Uddin, Md. Tanzim Hossain, Mohammed Forhad Uddin, Umair Zulfiqar",
    "link": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4474183",
    "month": "JUN",
    "paper_type": "Journal",
    "project_id": "3"
  },
  {
    "paper_id": "75",
    "day": "13",
    "year": "2021",
    "paper_title": "Pothole Detection System Using Region-Based Convolutional Neural Network",
    "journal_name": "2021 IEEE 4th International Conference on Computer and Communication Engineering Technology (CCET)",
    "short_description": "Street surface weakening, for example, potholes, has caused drivers substantial money-related harm each year. Notwithstanding, viable street condition observing has been a proceeding with a challenge to street proprietors.",
    "long_description": "Street surface weakening, for example, potholes, has caused drivers substantial money-related harm each year. Notwithstanding, viable street condition observing has been a proceeding with a challenge to street proprietors. Profundity cameras have a small field of view and can be effectively influenced by vehicle bobbing. Customary picture handling strategies are dependent on calculations. For example, the division can't adjust to shifting ecological and camera situations. In this paper, the object detection API for pothole detection is used to test the set of images and videos and give the output results of the tested images and videos. By evaluating the R-CNN algorithm and SSD mobile net algorithm, the results of the test showed successful results in getting potholes from test images with a maximum confidence level of 93%.",
    "author_name": "Aaquib Javed, Md. Sayem Mahmud, Md. Takbir Alam, Md. Foysal Bin Ohab, Khandakar Ratul Ali, Abdullah Al Jobaer and M. M. Uddin",
    "link": "https://ieeexplore.ieee.org/abstract/document/9544396",
    "month": "AUG",
    "paper_type": "Conferences",
    "project_id": "1"
  },
  {
    "paper_id": "76",
    "day": "9",
    "year": "2021",
    "paper_title": "Frequency Limited H2 Optimal Model Reduction of Large-Scale Sparse Dynamical Systems",
    "journal_name": "arXiv",
    "short_description": "We mainly consider the frequency limited H2 optimal model order reduction of large-scale sparse generalized systems. For this purpose we need to solve two Sylvester equations. This paper proposes efficient algorithm to solve them efficiently. The ideas are also generalized to index-1 descriptor systems",
    "long_description": "We mainly consider the frequency limited H2 optimal model order reduction of large-scale sparse generalized systems. For this purpose we need to solve two Sylvester equations. This paper proposes efficient algorithm to solve them efficiently. The ideas are also generalized to index-1 descriptor systems. Numerical experiments are carried out using Python Programming Language and the results are presented to demonstrate the approximation accuracy and computational efficiency of the proposed techniques.",
    "author_name": "Xin Du, M. M. Uddin, A. Mostakim Fony and Md. Tanzim Hossain, Mohammad Sahadat Hossain",
    "link": "https://arxiv.org/abs/2101.04566",
    "month": "JAN",
    "paper_type": "Journal",
    "project_id": "2"
  },
  {
    "paper_id": "77",
    "day": "1",
    "year": "2021",
    "paper_title": "On the Frequency Limited H2 Optimal Model order Reduction of Large-Scale Dynamical Systems",
    "journal_name": "arXiv",
    "short_description": "We consider the problem of frequency limited \r\n optimal model order reduction for large-scale sparse linear systems. A set of first-order \r\n optimality conditions are derived for the frequency limited model order reduction problem.",
    "long_description": "We consider the problem of frequency limited \r\n optimal model order reduction for large-scale sparse linear systems. A set of first-order \r\n optimality conditions are derived for the frequency limited model order reduction problem. These conditions involve the solution of two frequency limited Sylvester equations that are known to be computationally complex. We discuss a framework for solving these matrix equations efficiently. The idea is also extended to the frequency limited \r\n optimal model order reduction of index-1 descriptor systems. Numerical experiments are carried out using Python programming language and the results are presented to demonstrate the approximation accuracy and computational efficiency of the proposed technique.",
    "author_name": "Xin Du, M. M. Uddin, A. Mostakim Fony and Md. Tanzim Hossain, Md. Nazmul Islam Shuzan, Mohammad Sahadat Hossain",
    "link": null,
    "month": "JAN",
    "paper_type": "Submitted",
    "project_id": "2"
  }
]
