[
  {
    "id": "1",
    "project_nav_name": "BANBEIS",
    "projectname": "Developing Mathematical Algorithms and Softwares for the Model Reduction of Large-Scale Dynamical Systems",
    "projectid": "MS20191055",
    "funded_by": "Bangladesh Ministry of Education (BANBEIS)",
    "pi": "Dr. Mohammad Monir Uddin (monir.uddin@northsouth.edu)",
    "co_pi_1": "Prof Dr. Farahad Uddin (BUET) (forhad@math.buet.ac.bd)",
    "co_pi_2": null,
    "co_pi_3": null,
    "Project_duration": "3 years (Started from November 2019)",
    "project_outcome": "Model order reduction (MOR) is considered as an indispensable subject in the different branches of Science, Engineering and Technology. The demand of MOR is increasing everyday in the different branches of Science, Engineering and Technology. The main goal of this research is to develop robust algorithms and software using different prominent methods of the MOR. The possible significant outcomes of this research are as follows.",
    "project_overview": "",
    "project_banner": "photos/4_Tfj1FGS.png",
    "project_status": "previous"
  },
  {
    "id": "2",
    "project_nav_name": "nsu_ctrg_2019_2020",
    "projectname": "MODEL REDUCTION OF SECOND-ORDER DESCRIPTOR SYSTEMS OVER FINITE-FREQUENCY INTERVAL (CTRG-19/SEPS/05)",
    "projectid": "CTRG-19-SEPS-05",
    "funded_by": "North South University",
    "pi": "Dr. Mohammad Monir Uddin (monir.uddin@northsouth.edu)",
    "co_pi_1": "Dr. Xin Du (duxin@shu.edu.cn)",
    "co_pi_2": null,
    "co_pi_3": null,
    "Project_duration": "1 years (Started from October 2019)",
    "project_outcome": "In this project we proposed to develop algorithms for the frequency limited model reduction of large-scale sparse descriptor systems. The proposed research work has been successfully done theoretically and some numerical experiments also have been carried out. The results have been shown in the attached papers. Some numerical experiments are being carried out at a automation lab of Shanghai University, China. The project was supposed to be ended by September 2020. Due to pandemic problem it was delayed by three months. In future work we will generalize the ideas obtained here for limited time interval case.",
    "project_overview": "Before implementing new ideas or decisions in different disciplines of science, engineering, and technology, an experiment is required. The classical approach of this experiment would require a laboratory with a lot of new equipment, which is an expensive method to demonstrate a concept. The modern approach, rather less expensive and often easier to apply than experiments, to explore scientific ideas to convince others of their validity is through computer simulation.",
    "project_banner": "photos/2-1.png",
    "project_status": "previous"
  },
  {
    "id": "3",
    "project_nav_name": "nsu_ctrg_2020_2021",
    "projectname": "Approximation of Large-Scale Dynamical System over a Limited Time Interval. (CTRG-20/SEPS/20)",
    "projectid": "CTRG-20-SEPS-20",
    "funded_by": "North South University",
    "pi": "Dr. Mohammad Monir Uddin (monir.uddin@northsouth.edu)",
    "co_pi_1": "Mohammad Niaz Morsed (mohammad.murshed@northsouth.edu)",
    "co_pi_2": null,
    "co_pi_3": null,
    "Project_duration": "1 years (Started from March 2021)",
    "project_outcome": "In this project we proposed to develop algorithms for the frequency limited model reduction of large-scale sparse descriptor systems. The proposed research work has been successfully done theoretically and some numerical experiments also have been carried out. The results have been shown in the attached papers. Some numerical experiments are being carried out at a automation lab of Shanghai University, China. The project was supposed to be ended by September 2020. Due to pandemic problem it was delayed by three months. In future work we will generalize the ideas obtained here for limited time interval case.",
    "project_overview": "Model order reduction (MOR) is considered as an indispensable subject in the different branches of Science, Engineering and Technology. The demand of MOR is increasing everyday in the different branches of Science, Engineering and Technology. Over the last few decades many methods havebeen developed to perform the model reduction of large-scale dynamical system.Every method has advantages",
    "project_banner": "photos/Full_Mesh_AnL4ty4.jpg",
    "project_status": "previous"
  },
  {
    "id": "4",
    "project_nav_name": "nsu_ctrg_2021_2022",
    "projectname": "Model Order Reduction for Aircraft Wing Shape Optimization (CTRG-21/SEPS/15)",
    "projectid": "CTRG-21-SEPS-15",
    "funded_by": "North South University",
    "pi": "Dr. Mohammad Monir Uddin (monir.uddin@northsouth.edu)",
    "co_pi_1": null,
    "co_pi_2": null,
    "co_pi_3": null,
    "Project_duration": "1 years (Started from April 2022)",
    "project_outcome": "N/A",
    "project_overview": "Over the last few decades, enormous researches have been done on WSO which has mainly emphasized the physical model development rather than the generation of the data model. However, the data model is crucial for numerical analysis since it reflects all the characteristics of the physical model and easy to handle for optimization. Due to the presence of redundant data, the smooth computation can never be performed on the unoptimized mathematical model.",
    "project_banner": "photos/5-1-1_yvywE1W.png",
    "project_status": "previous"
  }
]
